[{"episode_summary": "Widower Michael Bluth has been working for his father's development company since he was a teenager manning the family's frozen banana stand, and he and his son George Michael have gone so ...", "episode_number": 1, "season_number": 1, "episode_name": "Pilot", "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0515236/"}, {"episode_summary": "Michael suspects that George Sr. is running the business from inside prison. George Michael is made manager of the banana stand, and Michael gives GOB a letter to mail after Lucille suggests that he be included in the business.", "episode_number": 2, "season_number": 1, "episode_name": "Top Banana", "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt0515256/"}, {"episode_summary": "Lucille suggests that Buster be included in the family activities, but Buster is reluctant to leave his mother's apartment in hopes of avoiding Lucille 2. Meanwhile, Tobias takes over the ...", "episode_number": 3, "season_number": 1, "episode_name": "Bringing Up Buster", "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0515212/"}, {"episode_summary": "Determined to not be upstaged by his actress girlfriend, GOB decides to pull an elaborate escape at the Orange County Prison, where George Sr. is being held. Meanwhile, Michael falls for GOB's girlfriend Marta.", "episode_number": 4, "season_number": 1, "episode_name": "Key Decisions", "episode_rating": 8.6, "episode_url": "http://www.imdb.com/title/tt0515223/"}, {"episode_summary": "To help the company's image, Lindsay returns to her roots - charity fund raisers. While Lindsay is the most charitable member of the family, Michael tries to prove he's a more charitable ...", "episode_number": 5, "season_number": 1, "episode_name": "Charity Drive", "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0515214/"}, {"episode_summary": "Michael gets a tip about the company's international accounts, and has GOB question the office secretary Kitty about them. But that's not before Michael does the unthinkable - setting up a conjugal visit between George Sr. and Lucille.", "episode_number": 6, "season_number": 1, "episode_name": "Visiting Ours", "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0515257/"}, {"episode_summary": "It's time for the annual Living Classics Pageant, and Barry makes a deal with Michael to get George Sr. out in time to take part in the pageant's signature exhibit - Michaelangelo's The ...", "episode_number": 7, "season_number": 1, "episode_name": "In God We Trust", "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0515221/"}, {"episode_summary": "Michael cannot remember anything about the car accident he and Lucille were in. While he's trying to piece together the accident, GOB thinks Michael is planning to escape to South America ...", "episode_number": 8, "season_number": 1, "episode_name": "My Mother the Car", "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0515231/"}, {"episode_summary": "Determined to get back in the Magician's Alliance, GOB puts on one last big show, thanks to his brother Michael. Michael, hoping to steal Marta away from GOB, tries to pull a scam almost as...", "episode_number": 9, "season_number": 1, "episode_name": "Storming the Castle", "episode_rating": 8.6, "episode_url": "http://www.imdb.com/title/tt0515247/"}, {"episode_summary": "When Michael suspects that George Michael has been smoking marijuana, he enlists the help of a one-armed man his father used to scare them as children. GOB and Buster participate in the ...", "episode_number": 10, "season_number": 1, "episode_name": "Pier Pressure", "episode_rating": 9.1, "episode_url": "http://www.imdb.com/title/tt0515235/"}, {"episode_summary": "The family's new public relations director gives them each a task while Michael tries to get his son in the prestigious Milford Academy. Buster, a graduate, is to be neither seen nor heard....", "episode_number": 11, "season_number": 1, "episode_name": "Public Relations", "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0515238/"}, {"episode_summary": "It's Valentine's Day and everyone but Michael has a reason to celebrate. Buster, tired of dealing with his mother, goes to live with the rest of the family in the model home. But soon Marta...", "episode_number": 12, "season_number": 1, "episode_name": "Marta Complex", "episode_rating": 8.6, "episode_url": "http://www.imdb.com/title/tt0515226/"}, {"episode_summary": "After Tobias moves into his room, George Michael gets a rather curious tip about his cousin's origins, so he decides to investigate. GOB, worried about his girlfriend Marta, heads down to ...", "episode_number": 13, "season_number": 1, "episode_name": "Beef Consomme", "episode_rating": 8.6, "episode_url": "http://www.imdb.com/title/tt0515210/"}, {"episode_summary": "George Bluth Sr. gets a visit from a rabid female fan who may be in love with him. George Michael is interested in his teacher, and so is his father. Gob tries to get revenge on Michael for trying to steal his girlfriend.", "episode_number": 14, "season_number": 1, "episode_name": "Shock and Aww", "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt0515244/"}, {"episode_summary": "Michael is tired of the family getting free handouts from the Bluth Company without doing anything, so he puts them to work. He puts Lindsay to work at the company answering phones, while ...", "episode_number": 15, "season_number": 1, "episode_name": "Staff Infection", "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt0515246/"}, {"episode_summary": "Micheal has a one-night stand with a woman named Maggie Lizer. He has a guilt-trip after learning she is blind, but not so much after he discovers that she's the prosecuting attorney ...", "episode_number": 16, "season_number": 1, "episode_name": "Altar Egos", "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt0515208/"}, {"episode_summary": "Michael gets an evidence file about his family after sleeping with the Maggie Lizer, the prosecuting attorney. But he suspects that she's not exactly telling the truth, so he sends Tobias ...", "episode_number": 17, "season_number": 1, "episode_name": "Justice Is Blind", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515222/"}, {"episode_summary": "Spring Break hits Orange County, and GOB plans to take his magic act to the popular video series \"Girls With Low Self Esteem\" by making the family yacht disappear. Michael becomes concerned...", "episode_number": 18, "season_number": 1, "episode_name": "Missing Kitty", "episode_rating": 8.6, "episode_url": "http://www.imdb.com/title/tt0515228/"}, {"episode_summary": "The family accountant, Ira Gilligan, is planning to snitch, and George Sr. will do everything possible to stop him. He enlists GOB to throw a party, where he will try to make Ira flee the ...", "episode_number": 19, "season_number": 1, "episode_name": "Best Man for the Gob", "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0515211/"}, {"episode_summary": "Some company funds have been unfrozen, and everyone in the family wants a cut of it. Michael makes a bad investment on his uncle Oscar's land, and takes the blame for it. Meanwhile George ...", "episode_number": 20, "season_number": 1, "episode_name": "Whistler's Mother", "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0515258/"}, {"episode_summary": "Michael decides that it's time to retire a long-running joke involving George-Michael and \"Take Your Daughter To Work Day\", so he brings Maeby along for the ride instead. The police get ...", "episode_number": 21, "season_number": 1, "episode_name": "Not Without My Daughter", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515232/"}, {"episode_summary": "Michael learns the real secret behind the Bluth Company's international accounts - his dad may have been illegally building houses similar to the one he lives in in Iraq. George Sr. agrees ...", "episode_number": 22, "season_number": 1, "episode_name": "Let 'Em Eat Cake", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515224/"}, {"episode_summary": "Michael Bluth denounces his family after George Sr. escapes to Mexico with his secretary Kitty. But when Michael announces plans to move to Phoenix, Barry informs him that he cannot leave ...", "episode_number": 1, "season_number": 2, "episode_name": "The One Where Michael Leaves", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515253/"}, {"episode_summary": "Michael's new business model backfires when GOB suggests that they build a fake house in two weeks. Meanwhile, George Sr. turns up in Mexico, only to be captured by prison guards who have ...", "episode_number": 2, "season_number": 2, "episode_name": "The One Where They Build a House", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515254/"}, {"episode_summary": "Michael gets a lead that his father has fled to Mexico and takes along a group to retrieve him. In the meantime, he tries to connect with George-Michael's girlfriend, Ann, and Buster tries to escape going off to the army by stowing away.", "episode_number": 3, "season_number": 2, "episode_name": "Amigos", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515209/"}, {"episode_summary": "George is declared dead in Mexico and the Bluth family holds a wake for their dead family member. Meanwhile, George isn't dead and has returned to the USA, only to be found by a newly dumped George Michael.", "episode_number": 4, "season_number": 2, "episode_name": "Good Grief!", "episode_rating": 9.0, "episode_url": "http://www.imdb.com/title/tt0515219/"}, {"episode_summary": "Some unfortunate pictures of Tobias wind up on the internet, which the military mistakes for pictures of Iraq and proof that the Bluth Company was building houses over there. Wayne Jarvis, ...", "episode_number": 5, "season_number": 2, "episode_name": "Sad Sack", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515243/"}, {"episode_summary": "While Buster looks for ways to get out of serving in Iraq, Lindsay's quest to score a date at the Bluth Company Christmas party backfires after GOB's sexual harassment speech. Michael and ...", "episode_number": 6, "season_number": 2, "episode_name": "Afternoon Delight", "episode_rating": 9.0, "episode_url": "http://www.imdb.com/title/tt0515207/"}, {"episode_summary": "GOB suspects that rival housing contractor Stan Sitwell is up for a power grab at the Bluth Company when he wants to hire GOB. Michael plans the annual softball game between the rival ...", "episode_number": 7, "season_number": 2, "episode_name": "Switch Hitter", "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0515248/"}, {"episode_summary": "Michael finds out that some company funds have been unfrozen, which the family quickly spends on some elaborate stuff. He then trades the family's portable stairway vehicle for a Corvette. ...", "episode_number": 8, "season_number": 2, "episode_name": "Queen for a Day", "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0515239/"}, {"episode_summary": "The family's careless selfish spending sprees cause them to lose control of the Bluth Company to Lucille 2. GOB tries to regain control of the company by courting Lucille 2. Michael ...", "episode_number": 9, "season_number": 2, "episode_name": "Burning Love", "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt0515213/"}, {"episode_summary": "Desperate to find money, at George Sr.'s request, Michael contacts \"Uncle Jack\", a man who the family has had past business relations with. Meanwhile, the family members enjoy their weekend...", "episode_number": 10, "season_number": 2, "episode_name": "Ready, Aim, Marry Me", "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0515240/"}, {"episode_summary": "Maggie Lizer returns after Michael bumps into her at the courtroom. But that's not before he realizes that she's 8 1/2 months pregnant. This comes after Michael tries to go after his ...", "episode_number": 11, "season_number": 2, "episode_name": "Out on a Limb", "episode_rating": 8.6, "episode_url": "http://www.imdb.com/title/tt0515234/"}, {"episode_summary": "Lindsay and Tobias continue to investigate the mysterious pregnancy by Maggie Lizer, while Michael continues to see her. Buster prepares to go off to Iraq, but before doing so, decides to ...", "episode_number": 12, "season_number": 2, "episode_name": "Hand to God", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515220/"}, {"episode_summary": "Lucille recruits George Michael to take Buster's place at the annual mother son dinner dance. While Michael and GOB are busy tracking down the seal that ate Buster's hand, Tobias signs away...", "episode_number": 13, "season_number": 2, "episode_name": "Motherboy XXX", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515229/"}, {"episode_summary": "At his girlfriend's request, George-Michael decides to run for class president, but finds that it will not be easy competing with his rival, Steve Holt. Once again, Michael and GOB find ...", "episode_number": 14, "season_number": 2, "episode_name": "The Immaculate Election", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515251/"}, {"episode_summary": "Determined to get back in the Magician's Alliance, GOB buys a sword from a Chinese shop and hires Buster to be the main magician while he's the assistant. Then he meets Tony Wonder who wants GOB and Buster to be on his next DVD.", "episode_number": 15, "season_number": 2, "episode_name": "Sword of Destiny", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515255/"}, {"episode_summary": "Michael thinks George-Michael has set the bar too low with his dating standards, so he sets up a meeting between Ann's ultra-conservative parents and his family, hoping that would break ...", "episode_number": 16, "season_number": 2, "episode_name": "Meat the Veals", "episode_rating": 9.0, "episode_url": "http://www.imdb.com/title/tt0515227/"}, {"episode_summary": "GOB is hoping to get even with the producers of \"Girls With Low Self Esteem\" after they botched his attempt to make the yacht disappear. Michael decides that it's finally time to get ...", "episode_number": 17, "season_number": 2, "episode_name": "Spring Breakout", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515245/"}, {"episode_summary": "Michael thinks it's time for George Sr. to leave the attic where he's been hiding as a fugitive. George-Michael helps his girlfriend Ann stage a protest against the American remake of the ...", "episode_number": 18, "season_number": 2, "episode_name": "Righteous Brothers", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515241/"}, {"episode_summary": "Michael learns that it's actually George Sr.'s twin brother Oscar serving time in prison, not George. After getting a tip from Barry, Michael heads to Reno to find George, but that costs him a camping trip he promised his son.", "episode_number": 1, "season_number": 3, "episode_name": "The Cabin Show", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515250/"}, {"episode_summary": "George Sr. drops a major bombshell that he was working with a British syndicate who conned him into building the house in Iraq. Michael decides to investigate the claim by heading to the ...", "episode_number": 2, "season_number": 3, "episode_name": "For British Eyes Only", "episode_rating": 8.6, "episode_url": "http://www.imdb.com/title/tt0515249/"}, {"episode_summary": "George Sr. is placed under house arrest by the family's new attorney Bob Loblaw, and finds that it's not exactly a walk in the park. Michael sets up his first date with Rita, but Rita has ...", "episode_number": 3, "season_number": 3, "episode_name": "Forget Me Now", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515218/"}, {"episode_summary": "To prove he's a man to Rita, Michael and his nephew Steve Holt compete in the Church And State Fair's annual triathlon. George Sr. tries to scare some at-risk youth, and Tobias tries to ...", "episode_number": 4, "season_number": 3, "episode_name": "Notapusy", "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0515233/"}, {"episode_summary": "The family's meeting with Japanese investors backfires big time when Tobias mistakes a real government agent for a talent agent. GOB tries to connect with his father, who is controlling a ...", "episode_number": 5, "season_number": 3, "episode_name": "Mr. F", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515230/"}, {"episode_summary": "Michael plans to marry Rita, but that's not before her uncle Trevor intervenes, and Michael discovers Rita's handicap. When the family learns that Rita has millions of dollars, they try to speed up the wedding process.", "episode_number": 6, "season_number": 3, "episode_name": "The Ocean Walker", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515252/"}, {"episode_summary": "The family plans their annual fund raiser, and they actually have a cause this time - Tobias is ailing due to his transplanted hair plugs, which appear to be rejecting him. Lindsay uses the...", "episode_number": 7, "season_number": 3, "episode_name": "Prison Break-In", "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt0515237/"}, {"episode_summary": "Michael is tired of his father always having GOB compete with him, so Michael gets GOB his own banana stand franchise, only to find that GOB has set it up 20 feet from the old one. After ...", "episode_number": 8, "season_number": 3, "episode_name": "Making a Stand", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515225/"}, {"episode_summary": "George Sr. suggests a last-ditch effort to save the family by holding a fund raiser to raise money to pay their legal expenses. Michael suggests to Lindsay that she take over the house work...", "episode_number": 9, "season_number": 3, "episode_name": "S.O.B.s", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515242/"}, {"episode_summary": "As the family's upcoming deposition nears, they participate in a mock trial, hosted by Judge Reinhold. Michael searches for a mysterious witness on the list, while the prosecuting attorney ...", "episode_number": 10, "season_number": 3, "episode_name": "Fakin' It", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0515216/"}, {"episode_summary": "Michael's quest to locate the mysterious \"N. Bluth\" leads him to Nellie, a prostitute who he believes is his long-lost sister, and the woman who just might be able to clear everything up. ...", "episode_number": 11, "season_number": 3, "episode_name": "Family Ties", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515217/"}, {"episode_summary": "GOB heads to Iraq via his participation in the U.S.O., where he is quickly arrested and being held by the U.S. military. The prosecutors believe this is treasonous, so Michael and Buster ...", "episode_number": 12, "season_number": 3, "episode_name": "Exit Strategy", "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0515215/"}, {"episode_summary": "After returning home from Iraq, George Sr. is finally cleared of all charges, and Michael is relieved to be the head of a successful company for a change. The real brains behind the madness...", "episode_number": 13, "season_number": 3, "episode_name": "Development Arrested", "episode_rating": 9.1, "episode_url": "http://www.imdb.com/title/tt0757386/"}, {"episode_summary": "Michael says goodbye to the family business and starts his own. The life of the family turns upside down when their mailman Pete dies.", "episode_number": 1, "season_number": 4, "episode_name": "Flight of the Phoenix", "episode_rating": 8.1, "episode_url": "http://www.imdb.com/title/tt2128813/"}, {"episode_summary": "George Sr. comes up with a get rich quick scam after his family falls apart.", "episode_number": 2, "season_number": 4, "episode_name": "Borderline Personalities", "episode_rating": 7.4, "episode_url": "http://www.imdb.com/title/tt2128815/"}, {"episode_summary": "Lindsay tries to reclaim her sense of self while traveling and getting back to her political activist roots.", "episode_number": 3, "season_number": 4, "episode_name": "Indian Takers", "episode_rating": 7.4, "episode_url": "http://www.imdb.com/title/tt2128816/"}, {"episode_summary": "", "episode_number": 4, "season_number": 4, "episode_name": "The B. Team", "episode_rating": 8.2, "episode_url": "http://www.imdb.com/title/tt2128817/"}, {"episode_summary": "Tobias searches for meaning after splitting with Lindsay, only to find that old habits die hard.", "episode_number": 5, "season_number": 4, "episode_name": "A New Start", "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt2128818/"}, {"episode_summary": "", "episode_number": 6, "season_number": 4, "episode_name": "Double Crossers", "episode_rating": 7.8, "episode_url": "http://www.imdb.com/title/tt2128819/"}, {"episode_summary": "Gob finds a new group of friends after his relationship falls apart and his family abandons him.", "episode_number": 7, "season_number": 4, "episode_name": "Colony Collapse", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt2128820/"}, {"episode_summary": "Lindsay distances herself from her family by starting a new career.", "episode_number": 8, "season_number": 4, "episode_name": "Red Hairing", "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt2128821/"}, {"episode_summary": "Tobias attempts to recover from a series of bad choices by reigniting his passion: both professionally and romantically.", "episode_number": 9, "season_number": 4, "episode_name": "Smashed", "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt2128822/"}, {"episode_summary": "Lucille adjusts to her new home only to find out her children are divvying up her old one.", "episode_number": 10, "season_number": 4, "episode_name": "Queen B.", "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt2128814/"}, {"episode_summary": "", "episode_number": 11, "season_number": 4, "episode_name": "A New Attitude", "episode_rating": 9.0, "episode_url": "http://www.imdb.com/title/tt2495824/"}, {"episode_summary": "", "episode_number": 12, "season_number": 4, "episode_name": "Señoritis", "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt2604336/"}, {"episode_summary": "", "episode_number": 13, "season_number": 4, "episode_name": "It Gets Better", "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt2604334/"}, {"episode_summary": "", "episode_number": 14, "season_number": 4, "episode_name": "Off the Hook", "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt2604338/"}, {"episode_summary": "", "episode_number": 15, "season_number": 4, "episode_name": "Blockheads", "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt2826310/"}]