[{"episode_name": "A Stitch in Time", "season_number": 1, "episode_summary": "In the year 2077, 8 terrorists from the group Liberate manage to avoid execution by transporting themselves to 2012. In doing so however, they also transport Kiera Cameron, a law ...", "episode_url": "http://www.imdb.com/title/tt2243841/", "episode_rating": 8.2, "episode_number": 1}, {"episode_name": "Fast Times", "season_number": 1, "episode_summary": "Kiera's pretense of being a Portland police officer doesn't last very long and she soon finds herself under arrest. She manages to get free and with young Alec Sadler's help, creates a ...", "episode_url": "http://www.imdb.com/title/tt2273947/", "episode_rating": 7.9, "episode_number": 2}, {"episode_name": "Wasting Time", "season_number": 1, "episode_summary": "Kiera and Carlos investigate two deaths where the victims have had large cylindrical holes incised into the backs of their necks. A review of the victims' DNA reveal a special gene, one ...", "episode_url": "http://www.imdb.com/title/tt2273955/", "episode_rating": 7.8, "episode_number": 3}, {"episode_name": "Matter of Time", "season_number": 1, "episode_summary": "Kiera and Carlos investigate the murder of a Professor Ames who was experimenting with a high energy device. It's apparent that the weapon used to kill him is quite advanced and Kiera ...", "episode_url": "http://www.imdb.com/title/tt2262689/", "episode_rating": 7.8, "episode_number": 4}, {"episode_name": "A Test of Time", "season_number": 1, "episode_summary": "Edouard Kagame has a plan to get rid of Kiera once and for all: by killing her grandmother Lily Cole so that Kiera will never be born. The first woman they kill by the name of Lilly Cole ...", "episode_url": "http://www.imdb.com/title/tt2268961/", "episode_rating": 8.0, "episode_number": 5}, {"episode_name": "Time's Up", "season_number": 1, "episode_summary": "Liber8 is actively supporting and encouraging violent protests but it all becomes deadly serious when they kidnap the CEO of Exotrol, Henrietta Sherman. Kiera suspects Liber8 was behind the...", "episode_url": "http://www.imdb.com/title/tt2273953/", "episode_rating": 7.7, "episode_number": 6}, {"episode_name": "The Politics of Time", "season_number": 1, "episode_summary": "Carlos finds himself investigating the murder of a woman he slept with the night before her death. He had received a call from an old friend, Jim Martin, who was having an argument with ...", "episode_url": "http://www.imdb.com/title/tt2273951/", "episode_rating": 7.8, "episode_number": 7}, {"episode_name": "Playtime", "season_number": 1, "episode_summary": "Kiera and Carlos investigate two murders where the shooters immediately committed suicide after eliminating their victims. Both were software testers for a local computer gaming company ...", "episode_url": "http://www.imdb.com/title/tt2273949/", "episode_rating": 7.9, "episode_number": 8}, {"episode_name": "Family Time", "season_number": 1, "episode_summary": "Kiera and Carlos visit Roland Randol's farm to check up on an excessively large purchase of farm fertilizer. Kiera is somewhat taken aback to find Alec there, not realizing that Randol is ...", "episode_url": "http://www.imdb.com/title/tt2273945/", "episode_rating": 8.3, "episode_number": 9}, {"episode_name": "End Times", "season_number": 1, "episode_summary": "After spending the night with Kellog, Kiera meets Jason who convinces her he was in the control room when the time travel device went off only he was sent back to 1992 and for 20 years has ...", "episode_url": "http://www.imdb.com/title/tt2317581/", "episode_rating": 8.8, "episode_number": 10}, {"episode_name": "Second Chances", "season_number": 2, "episode_summary": "Still disturbed by the message he received from his future self, Alec is lying low and doing his best to avoid Kiera. He's moved out but ignores his mother's pleas to return home. Kiera has...", "episode_url": "http://www.imdb.com/title/tt2358924/", "episode_rating": 8.0, "episode_number": 1}, {"episode_name": "Split Second", "season_number": 2, "episode_summary": "Alec starts his job at the computer store but his initiative isn't appreciated by his new boss. Matthew Kellog has a better proposition for him. When Sonya learns that Travis is alive she ...", "episode_url": "http://www.imdb.com/title/tt2533200/", "episode_rating": 7.9, "episode_number": 2}, {"episode_name": "Second Thoughts", "season_number": 2, "episode_summary": "Sonya continues expanding Liber8's business dealings with the Coalition Kings biker gang who carried out the mayors killing. Travis however has his own plans not only to end Sonya's control...", "episode_url": "http://www.imdb.com/title/tt2533212/", "episode_rating": 7.7, "episode_number": 3}, {"episode_name": "Second Skin", "season_number": 2, "episode_summary": "Travis' faction of Liber8 has taken to blowing up tanker trucks of gas and oil. It's an effective public relations move and the public is buying into it. Alec believes another time traveler...", "episode_url": "http://www.imdb.com/title/tt2533204/", "episode_rating": 8.1, "episode_number": 4}, {"episode_name": "Second Opinion", "season_number": 2, "episode_summary": "It's her son Sam's birthday and Kiera is out of sorts.Vancouver PD has a new police chief and Insp. Dillon is replaced by Insp. Nora Harris whose main task is to find the mole in the ...", "episode_url": "http://www.imdb.com/title/tt2533210/", "episode_rating": 8.0, "episode_number": 5}, {"episode_name": "Second Truths", "season_number": 2, "episode_summary": "Kiera finds herself working with Carlos on a murder case, the work of a serial killer. She's not entirely unfamiliar with the case as she had studied it in 2077. One thing she knows is that...", "episode_url": "http://www.imdb.com/title/tt2533208/", "episode_rating": 8.3, "episode_number": 6}, {"episode_name": "Second Degree", "season_number": 2, "episode_summary": "Kiera visits her friend Elena's grave only to find that someone has removed her body. She assumes it has to have been taken by someone who knew she was from the future. She learns that an ...", "episode_url": "http://www.imdb.com/title/tt2533214/", "episode_rating": 8.0, "episode_number": 7}, {"episode_name": "Second Listen", "season_number": 2, "episode_summary": "Kiera and CSIS agent Gardiner start working together and try to trace the bodies stolen from the morgue. They hit a dead end. Kiera visits Usher who tells her about freelancers who tattoo ...", "episode_url": "http://www.imdb.com/title/tt2822488/", "episode_rating": 8.2, "episode_number": 8}, {"episode_name": "Seconds", "season_number": 2, "episode_summary": "Kiera and Carlos are surprised when Inspector Dillon returns to the squad room once again in charge. He can thank Eschur for his reinstatement. The squad will now be dedicated solely to ...", "episode_url": "http://www.imdb.com/title/tt2859362/", "episode_rating": 8.0, "episode_number": 9}, {"episode_name": "Second Wave", "season_number": 2, "episode_summary": "Kiera has put the Julian incident behind her and assures Alec that if Julian keeps his word and follows a new path, she will as well. Alec manages to locate Garza and Kiera takes her into ...", "episode_url": "http://www.imdb.com/title/tt2846224/", "episode_rating": 8.2, "episode_number": 10}, {"episode_name": "Second Guess", "season_number": 2, "episode_summary": "Everyone in Vancouver is the victim of a severe cyber-attack. At first it's only the Internet that seems affected but soon, traffic lights are malfunction and ATM's are spewing out money. ...", "episode_url": "http://www.imdb.com/title/tt3039826/", "episode_rating": 8.3, "episode_number": 11}, {"episode_name": "Second Last", "season_number": 2, "episode_summary": "Kiera and Carlos are trying to locate CSIS Agent Gardner but learn that the law firm he was to visit does not exist. Carlos finds his body in the trunk of his car and CSIS believes Kiera is...", "episode_url": "http://www.imdb.com/title/tt3039830/", "episode_rating": 8.5, "episode_number": 12}, {"episode_name": "Second Time", "season_number": 2, "episode_summary": "In a scene from the future, older Alec is aware of Liber8's plot and enlists the help of someone who is now living in the past. In the present Alec, devastated by Emily's death, visits ...", "episode_url": "http://www.imdb.com/title/tt3052424/", "episode_rating": 8.9, "episode_number": 13}]