[{"episode_summary": "Dexter takes part in the investigation of a serial killer who drains his victims of blood. He also kills two criminals, and his romantic relationship may be going to the next level.", "episode_rating": 8.8, "season_number": 1, "episode_number": 1, "episode_name": "Dexter"}, {"episode_summary": "Dexter's world of police analyst by day, and serial killer by night, is rocked when he's privately contacted by another serial killer, whom the department is investigating, who claims that ...", "episode_rating": 8.4, "season_number": 1, "episode_number": 2, "episode_name": "Crocodile"}, {"episode_summary": "After the dead body of another of victim of the so-called \"Ice Truck Killer\" is found on the ice rink at Miami's Hockey Dome, Dexter helps out Debra, newly transfered to the homicide squad ...", "episode_rating": 8.4, "season_number": 1, "episode_number": 3, "episode_name": "Popping Cherry"}, {"episode_summary": "The mysterious Ice Truck Killer escalates his killing spree by leaving body parts of his latest victim at sites that relate to memories from Dexter's childhood, leading Dexter him to confront his dark personal history.", "episode_rating": 8.8, "season_number": 1, "episode_number": 4, "episode_name": "Let's Give the Boy a Hand"}, {"episode_summary": "Debra and the rest of the squad start to make headway when one of the Ice Truck Killer victims is found alive. Meanwhile, Dexter gets in over-his-head trouble when he begins stalking a murderous human-trafficker.", "episode_rating": 8.7, "season_number": 1, "episode_number": 5, "episode_name": "Love American Style"}, {"episode_summary": "The Ice Truck Killer leaves a surprise dead body for Dexter at one of the crime scenes of Dexter's most recent kill, which puts him in the cross hairs of his own Homicide Division of the Miami Metro Police.", "episode_rating": 9.0, "season_number": 1, "episode_number": 6, "episode_name": "Return to Sender"}, {"episode_summary": "The Ice Truck Killer is supposedly identified, but Dexter is skeptical. Meanwhile, Rita must deal with the return of her menacing, recently paroled ex-husband.", "episode_rating": 8.8, "season_number": 1, "episode_number": 7, "episode_name": "Circle of Friends"}, {"episode_summary": "The suicide of a wealthy and powerful businesswoman leads Dexter to suspect that her psychologist may have killed her. But Dexter gets a surprise of his own when he pays a visit to the ...", "episode_rating": 9.0, "season_number": 1, "episode_number": 8, "episode_name": "Shrink Wrap"}, {"episode_summary": "Dexter learns that his biological father (named Joe Driscoll), whom he was told had died 30 years ago, has just recently died and left him everything he owned, including his house. He goes ...", "episode_rating": 8.7, "season_number": 1, "episode_number": 9, "episode_name": "Father Knows Best"}, {"episode_summary": "When the Ice Truck Killer leaves a horribly bloody crime scene at a hotel, Dexter digs deeper into his past.", "episode_rating": 9.1, "season_number": 1, "episode_number": 10, "episode_name": "Seeing Red"}, {"episode_summary": "Dexter investigates when the Ice Truck Killer strikes again, killing the prosthetic arm prostitute and leaving her body before a Christmas tree in Miami's Santa's Cottage. Sgt. Doakes ...", "episode_rating": 9.2, "season_number": 1, "episode_number": 11, "episode_name": "Truth Be Told"}, {"episode_summary": "Dexter races against the clock to find Debra when she is abducted by Rudy, the Ice Truck Killer, which leads the two psychopathic killers to have a fateful showdown, and who finally reveals his connection to Dexter.", "episode_rating": 9.5, "season_number": 1, "episode_number": 12, "episode_name": "Born Free"}, {"episode_summary": "Dexter becomes anxious and frustrated after more than a month without killing. When he finally gets his chance, he finds he is off his game.", "episode_rating": 8.9, "season_number": 2, "episode_number": 1, "episode_name": "It's Alive!"}, {"episode_summary": "Dexter, desperate to get his game back, seeks out Chino yet again; but the hulking gangster is waiting for him.", "episode_rating": 8.7, "season_number": 2, "episode_number": 2, "episode_name": "Waiting to Exhale"}, {"episode_summary": "Lying becomes the theme of Dexter's life when his lie - or rather, half-truth - about being an addict leads to Rita insisting that he join a 12-step program.", "episode_rating": 8.8, "season_number": 2, "episode_number": 3, "episode_name": "An Inconvenient Lie"}, {"episode_summary": "Rita feels threatened when she meets Dexter's new NA sponsor, Lila. She also deals with a visit from her estranged mother. Elsewhere, Dexter continues to try to throw the persistent FBI Agent Lundy off his trail.", "episode_rating": 8.6, "season_number": 2, "episode_number": 4, "episode_name": "See-Through"}, {"episode_summary": "Dexter learns that one of the three men who murdered his mother is still alive and, thanks to the Witness Protection Program, running a pub in Naples, FA.", "episode_rating": 8.8, "season_number": 2, "episode_number": 5, "episode_name": "The Dark Defender"}, {"episode_summary": "The Bay Area Butcher now has a copycat, and Dexter must stop him before Agent Lundy puts the Butcher case entirely into the hands of the FBI.", "episode_rating": 8.7, "season_number": 2, "episode_number": 6, "episode_name": "Dex, Lies, and Videotape"}, {"episode_summary": "Dexter sends the Miami Tribune a 32-page manifesto designed purely to baffle and mislead the police. His scheming continues as he finally fights back against Sgt. Doakes.", "episode_rating": 8.8, "season_number": 2, "episode_number": 7, "episode_name": "That Night, a Forest Grew"}, {"episode_summary": "Thanks to some deliberately bad blood work, Agent Lundy comes closer to uncovering the Bay Harbor Butcher.", "episode_rating": 9.0, "season_number": 2, "episode_number": 8, "episode_name": "Morning Comes"}, {"episode_summary": "Dexter is in shock when he realizes that his blood slides are gone. It seems that Agent Lundy really has him now; but there's more going on than he knows.", "episode_rating": 9.3, "season_number": 2, "episode_number": 9, "episode_name": "Resistance Is Futile"}, {"episode_summary": "As Dexter keeps Doakes caged in Jimenez's cabin, Doakes reveals that he knows something about the death of Dexter's father. This clue leads Dexter to discover a shocking truth.", "episode_rating": 8.9, "season_number": 2, "episode_number": 10, "episode_name": "There's Something About Harry"}, {"episode_summary": "Dexter decides that he needs to turn himself in, but gives himself a day to get his life together. Meanwhile, he leaves Doakes in his cage.", "episode_rating": 8.9, "season_number": 2, "episode_number": 11, "episode_name": "Left Turn Ahead"}, {"episode_summary": "Lila makes a shocking discovery about Dexter and takes advantage of it in a desperate ploy to win him back - or rather, force him back.", "episode_rating": 9.1, "season_number": 2, "episode_number": 12, "episode_name": "The British Invasion"}, {"episode_summary": "Dexter begins to question his blind loyalty to his father's memory. In an act of spontaneity, he wonders whether The Code of Harry is a necessity anymore.", "episode_rating": 8.5, "season_number": 3, "episode_number": 1, "episode_name": "Our Father"}, {"episode_summary": "Dexter catches up with Freebo, but once again the kill goes terribly wrong.", "episode_rating": 8.6, "season_number": 3, "episode_number": 2, "episode_name": "Finding Freebo"}, {"episode_summary": "Miguel continues to press his unwanted friendship on Dexter, who has other things to worry about - primarily a child molester who has his eye on Astor.", "episode_rating": 8.3, "season_number": 3, "episode_number": 3, "episode_name": "The Lion Sleeps Tonight"}, {"episode_summary": "Dexter botches his first marriage proposal to Rita, but a shocked and grieving fiancée's display of emotions provides him with clues on how to show the proper feelings himself.", "episode_rating": 8.3, "season_number": 3, "episode_number": 4, "episode_name": "All in the Family"}, {"episode_summary": "Through Miguel, Dexter learns of a wife-killer who has gone free - the perfect person for his next kill.", "episode_rating": 8.6, "season_number": 3, "episode_number": 5, "episode_name": "Turning Biminese"}, {"episode_summary": "Miguel surprises Dexter by agreeing to his unreasonable request: access to a white supremacist already in custody.", "episode_rating": 8.4, "season_number": 3, "episode_number": 6, "episode_name": "Sí se puede"}, {"episode_summary": "Dexter, who once chose his own victims, is now receiving requests - one from Miguel and another from Camilla.", "episode_rating": 8.6, "season_number": 3, "episode_number": 7, "episode_name": "Easy as Pie"}, {"episode_summary": "Dexter's friendship with Miguel grows closer - dangerously closer - when Miguel declares that he wants to make the next kill himself.", "episode_rating": 8.7, "season_number": 3, "episode_number": 8, "episode_name": "The Damage a Man Can Do"}, {"episode_summary": "Dexter learns that Miguel has struck out on his own and performed his own killing.", "episode_rating": 8.8, "season_number": 3, "episode_number": 9, "episode_name": "About Last Night"}, {"episode_summary": "Dexter needs leverage against Miguel and goes looking for it - specifically the ring Miguel took from Ellen Wolf as a trophy.", "episode_rating": 9.0, "season_number": 3, "episode_number": 10, "episode_name": "Go Your Own Way"}, {"episode_summary": "Maria suspects Miguel of Ellen Wolf's murder, and Dexter knows she suspects it. Dexter will have to make his move before Miguel goes after Maria.", "episode_rating": 8.8, "season_number": 3, "episode_number": 11, "episode_name": "I Had a Dream"}, {"episode_summary": "As the wedding day approaches, Dexter still has Ramon to deal with. Meanwhile, the Skinner is still loose, and Dexter is his next intended victim.", "episode_rating": 8.9, "season_number": 3, "episode_number": 12, "episode_name": "Do You Take Dexter Morgan?"}, {"episode_summary": "Dexter's sleep deprivation puts both his day job and his nighttime hunting in jeopardy. Lundy is back in town to capture the Trinity Killer - someone he can't even prove exists.", "episode_rating": 8.8, "season_number": 4, "episode_number": 1, "episode_name": "Living the Dream"}, {"episode_summary": "A sleep-deprived Dexter desperately tries to remember where he hid the body parts of his latest victim.", "episode_rating": 8.7, "season_number": 4, "episode_number": 2, "episode_name": "Remains to Be Seen"}, {"episode_summary": "Dexter is facing some marriage and parenting challenges. Rita is mothering him somewhat after the accident and is not allowing him to drive, as per the doctor's orders. Step-daughter Astor ...", "episode_rating": 8.4, "season_number": 4, "episode_number": 3, "episode_name": "Blinded by the Light"}, {"episode_summary": "With Rita away with the kids away attending a cousin's wedding, Dexter finally has the freedom to find another victim. He focuses on Zoey Kruger, a police officer whose husband and child ...", "episode_rating": 9.1, "season_number": 4, "episode_number": 4, "episode_name": "Dex Takes a Holiday"}, {"episode_summary": "With Debra recovering in the hospital, Dexter re-doubles his efforts to locate the Trinity Killer. Knowing that he is following the same pattern as his murders from 30 years ago, Dexter is ...", "episode_rating": 8.9, "season_number": 4, "episode_number": 5, "episode_name": "Dirty Harry"}, {"episode_summary": "Dexter knows it's only a matter of time before Miami Metro discovers the Trinity Killer's latest handiwork. Therefore, he has to work doubly hard to stay one step ahead of their ...", "episode_rating": 8.8, "season_number": 4, "episode_number": 6, "episode_name": "If I Had a Hammer"}, {"episode_summary": "Dexter is resting with his family in his boat not worried about the Trinity Killer that has completed his cycle of murders. Out of the blue, he is summoned by Miami Metro to analyze an arm ...", "episode_rating": 8.6, "season_number": 4, "episode_number": 7, "episode_name": "Slack Tide"}, {"episode_summary": "Dexter is uncomfortable for having killed an innocent. He visits Arthur Mitchell and his family and learns that Trinity is planning to travel to Tampa. Dexter plots a scheme to travel to a ...", "episode_rating": 8.6, "season_number": 4, "episode_number": 8, "episode_name": "Road Kill"}, {"episode_summary": "Dexter stops by Arthur's house for a visit and realizes that though Arthur is in appearance the happy family man, he is in fact terrorizing his family. According to Arthur's son Jonah, they...", "episode_rating": 9.3, "season_number": 4, "episode_number": 9, "episode_name": "Hungry Man"}, {"episode_summary": "When Arthur kidnaps a young boy from a video arcade, Dexter realizes that his killing cycle has started again and that it includes four, not three, killings. The disappearance of the boy is...", "episode_rating": 9.1, "season_number": 4, "episode_number": 10, "episode_name": "Lost Boys"}, {"episode_summary": "Dexter is determined to take care of the Trinity Killer/Arthur Mitchell himself, at least in part to atone for the mistake he made. When Dexter learns that Christine Hill is in custody, he ...", "episode_rating": 9.4, "season_number": 4, "episode_number": 11, "episode_name": "Hello, Dexter Morgan"}, {"episode_summary": "Dexter is obsessed with getting the Trinity Killer himself, especially after Arthur has tracked him to Metro Homicide and learns his real identity. Dexter realizes the threat to his family ...", "episode_rating": 9.7, "season_number": 4, "episode_number": 12, "episode_name": "The Getaway"}, {"episode_summary": "In the aftermath of last season's chilling finale, Rita's death has left Dexter feeling responsible, possibly even...guilty. Unable to deal with the trauma, Dexter makes a drastic decision ...", "episode_rating": 8.9, "season_number": 5, "episode_number": 1, "episode_name": "My Bad"}, {"episode_summary": "Dexter's interview with the FBI goes well he's told they don't suspect him of murder since he was at Trinity's house at the time Rita was killed. He's having trouble being a single parent ...", "episode_rating": 8.3, "season_number": 5, "episode_number": 2, "episode_name": "Hello, Bandit"}, {"episode_summary": "Dexter is still off duty recovering from recent events. He enlists Debra's help to find a nanny for 10-month old Harrison and finds the perfect candidate. Having childcare in place allows ...", "episode_rating": 8.6, "season_number": 5, "episode_number": 3, "episode_name": "Practically Perfect"}, {"episode_summary": "Having disposed of serial killer Boyd Fowler, Dexter now has to figure out what to do with the young woman he found alive in Fowler's house and who saw him get rid of her captor. He manages...", "episode_rating": 8.6, "season_number": 5, "episode_number": 4, "episode_name": "Beauty and the Beast"}, {"episode_summary": "Dexter tries to convince Lumen to return to Minnesota but isn't having much success. She is intent on finding the other men who abused her and kill them and Dexter realizes that perhaps the...", "episode_rating": 8.2, "season_number": 5, "episode_number": 5, "episode_name": "First Blood"}, {"episode_summary": "Dexter goes after his next victim, Lance Robinson, but before he can complete the deed receives a call from Lumen who hasn't left Miami and has tracked down one of her attackers. She's shot...", "episode_rating": 8.8, "season_number": 5, "episode_number": 6, "episode_name": "Everything Is Illumenated"}, {"episode_summary": "Having decided to help Lumen find the other men who attacked her, Dexter is at a loss when he is called to the scene of a road accident. There he finds a pick-up truck that has disgorged ...", "episode_rating": 8.6, "season_number": 5, "episode_number": 7, "episode_name": "Circle Us"}, {"episode_summary": "Having identified one of Lumen's attackers, Cole Harmon, Dexter set out to do what he does best. He attends one of Jordan Chase's seminars and the plan is to rent a hotel room next to Cole ...", "episode_rating": 8.8, "season_number": 5, "episode_number": 8, "episode_name": "Take It!"}, {"episode_summary": "Dexter has now set his sights on self-help guru Jordan Chase and is spending some time with him getting to know him better. His life is turned upside down however with the sudden arrival of...", "episode_rating": 8.9, "season_number": 5, "episode_number": 9, "episode_name": "Teenage Wasteland"}, {"episode_summary": "Lt. Laguerta has decided to re-open the barrel girls murder case and assigns a reinstated Debra Morgan and Quinn to arrest Cole Harmon. Of course, they don't know that Dexter has already ...", "episode_rating": 8.9, "season_number": 5, "episode_number": 10, "episode_name": "In the Beginning"}, {"episode_summary": "Dexter and Lumen are trying to figure out how to get Jordan Chase but he catches on to the fact they have been under video surveillance. He manages to trace the equipment back to Joey Quinn...", "episode_rating": 8.8, "season_number": 5, "episode_number": 11, "episode_name": "Hop a Freighter"}, {"episode_summary": "Just as Dexter is about to set off find Jordan Chase, his entire family arrives having decided to travel down from Orlando to celebrate Harrison's birthday in Miami. Cody and Astor have ...", "episode_rating": 8.8, "season_number": 5, "episode_number": 12, "episode_name": "The Big One"}, {"episode_summary": "Life for Dexter is returning to normal. He's taking care of his son with the help of Angel Batista's sister Jamie. He dispatches two EMTs who have been killing patients to harvest their ...", "episode_rating": 8.8, "season_number": 6, "episode_number": 1, "episode_name": "Those Kinds of Things"}, {"episode_summary": "Dexter lines up his next victim, Brother Sam a criminal who claims to have found religion and while still running his body repair shop, gives other ex-cons a chance at rehabilitation. ...", "episode_rating": 8.2, "season_number": 6, "episode_number": 2, "episode_name": "Once Upon a Time..."}, {"episode_summary": "Deb faces her first day as the homicide squad's Lieutenant. She isn't sure she's made the right decision given that she not used to the administrative side of the job and the fact that she ...", "episode_rating": 8.3, "season_number": 6, "episode_number": 3, "episode_name": "Smokey and the Bandit"}, {"episode_summary": "Dexter is in awe of the latest display from the Doomsday killer: the Four Horsemen of the Apocalypse made up of mannequins and human body parts. Testing confirms that the human parts all ...", "episode_rating": 8.5, "season_number": 6, "episode_number": 4, "episode_name": "A Horse of a Different Color"}, {"episode_summary": "Dexter runs background checks on Travis and discovers that he was a former student of Gellar. Batista and Quinn go to the university where Gellar used to teach.", "episode_rating": 8.1, "season_number": 6, "episode_number": 5, "episode_name": "The Angel of Death"}, {"episode_summary": "As Dexter is following Travis in the hope of finding Professor Geller, he learns of Brother Sam's shooting. He races to the hospital to learn Sam is unconscious. He sets out to find the ...", "episode_rating": 8.5, "season_number": 6, "episode_number": 6, "episode_name": "Just Let Go"}, {"episode_summary": "Having avenged Brother Sam's death, Dexter gets some bad news from Deb - it appears the Trinity Killer has returned to kill his wife and daughter, leaving his son Jonah as the only survivor...", "episode_rating": 7.9, "season_number": 6, "episode_number": 7, "episode_name": "Nebraska"}, {"episode_summary": "Dexter returns to Miami after his road trip to Nebraska and get a frosty reception from Debra who has been under pressure to get results in the doomsday killer case. He does his best to ...", "episode_rating": 7.9, "season_number": 6, "episode_number": 8, "episode_name": "Sin of Omission"}, {"episode_summary": "Having rescued Travis at the church, Dexter now tries to figure out what the next tableau will be. With Travis having agreed to help him, Dexter gets him a room in a hotel to keep him safe....", "episode_rating": 8.5, "season_number": 6, "episode_number": 9, "episode_name": "Get Gellar"}, {"episode_summary": "Now realizing the error he has made, Dexter redoubles his efforts to track down the doomsday killer and eliminate him. He plants evidence in the church to keep the police off the scent and ...", "episode_rating": 8.1, "season_number": 6, "episode_number": 10, "episode_name": "Ricochet Rabbit"}, {"episode_summary": "Dexter finds himself at the yacht where Travis and his accomplices were preparing the next tableau, \"Wormwood\". They quickly realize that Travis is planning a gas attack. Worried that ...", "episode_rating": 8.3, "season_number": 6, "episode_number": 11, "episode_name": "Talk to the Hand"}, {"episode_summary": "Stuck in the ocean miles from shore, Dexter is rescued by an old boat carrying illegal immigrants to the US. He even manages to render them a service. Once ashore, he heads home hoping to ...", "episode_rating": 9.0, "season_number": 6, "episode_number": 12, "episode_name": "This Is the Way the World Ends"}, {"episode_summary": "Having been caught in the act of eliminating Travis Marshall by his sister Deb, Dexter has to scramble to come up with an explanation. Deb is understandably shaken by what she's just seen ...", "episode_rating": 9.5, "season_number": 7, "episode_number": 1, "episode_name": "Are You...?"}, {"episode_summary": "With Deb having found all of Dexter's paraphernalia, including the blood slides, he has little choice but to admit everything. She decides not to arrest him or let the police know what he ...", "episode_rating": 8.9, "season_number": 7, "episode_number": 2, "episode_name": "Sunshine and Frosty Swirl"}, {"episode_summary": "With Deb keeping a close eye on him, Dexter is starting to go stir crazy. He desperately wants to satisfy his dark passenger but first decides to get Louis Greene out of his life forever. ...", "episode_rating": 8.8, "season_number": 7, "episode_number": 3, "episode_name": "Buck the System"}, {"episode_summary": "The police quickly catch up with Ray Speltzer and does a brilliant job interrogating him and getting a confession. She and others are shocked however when a judge ruled the arresting ...", "episode_rating": 8.9, "season_number": 7, "episode_number": 4, "episode_name": "Run"}, {"episode_summary": "After Deb learns that she has sent forensic evidence to an outside lab for analysis, Captain LaGuerta confides in her that she found a blood slide at the site of the Marshall killing and ...", "episode_rating": 8.7, "season_number": 7, "episode_number": 5, "episode_name": "Swim Deep"}, {"episode_summary": "Dexter decides he's going to eliminate Hanna McKay and gathers evidence that she has eliminated a number of people in her life. Something unexpected occurs however. LaGuerta begins to think...", "episode_rating": 8.5, "season_number": 7, "episode_number": 6, "episode_name": "Do the Wrong Thing"}, {"episode_summary": "Dexter's problems keep mounting. After the surprise outcome of his planned execution of Hannah McKay, they agree they are far too much alike and decide not to see each other again. It ...", "episode_rating": 8.6, "season_number": 7, "episode_number": 7, "episode_name": "Chemistry"}, {"episode_summary": "Having spent the night together, Hannah and Dexter decide to see each other again. He's not so sure what he's going to do about Deb however. She is adamant that Dexter get rid of Hannah but...", "episode_rating": 8.9, "season_number": 7, "episode_number": 8, "episode_name": "Argentina"}, {"episode_summary": "Isaak Sirko learns that the Koshka Brotherhood has sent two assassins to Miami to eliminate him. Surprisingly he turns to Dexter with a proposition: help him eliminate the assassins in ...", "episode_rating": 8.7, "season_number": 7, "episode_number": 9, "episode_name": "Helter Skelter"}, {"episode_summary": "There is another victim of the phantom arsonist, the fifth in two weeks. Dexter thinks has a pretty good idea who is behind it. He is frustrated because he promised Deb not to interfere in ...", "episode_rating": 8.5, "season_number": 7, "episode_number": 10, "episode_name": "The Dark... Whatever"}, {"episode_summary": "At Deb's request, Batista locates Arlene Schramm, the witness who saw Hannah McKay kill a counselor in a halfway house. When Deb blacks out and has a car accident, she thinks she knows who ...", "episode_rating": 8.9, "season_number": 7, "episode_number": 11, "episode_name": "Do You See What I See?"}, {"episode_summary": "Dexter visits Hannah in jail to explain why he didn't protect her and she in turn explains why she did what she did. She seems to understand Dexter but has her own plans which don't include...", "episode_rating": 9.2, "season_number": 7, "episode_number": 12, "episode_name": "Surprise, Motherfucker!"}, {"episode_summary": "It's now 6 months since Captain LaGuerta's death. Dexter is still working as a blood spatter expert but Deb has quit the force and is now working as a private investigator. She's also been ...", "episode_rating": 8.7, "season_number": 8, "episode_number": 1, "episode_name": "A Beautiful Day"}, {"episode_summary": "Dr. Vogel shows Dexter some video she shot when his father Harry visited her for help in treating him. Dexter was only 10 years old when Harry first visited her and she takes more than just...", "episode_rating": 8.2, "season_number": 8, "episode_number": 2, "episode_name": "Every Silver Lining..."}, {"episode_summary": "Deb is going through a particularly bad patch and there is nothing Dexter can seemingly do about it. A cop finds her behind the wheel her car, drunk. She had the good sense to pull over but...", "episode_rating": 8.2, "season_number": 8, "episode_number": 3, "episode_name": "What's Eating Dexter Morgan?"}, {"episode_summary": "The next potential killer on Vogel's list is A.J. Yates, who was institutionalized at 15. Vogel tried to channel his hostilities much as she did with Dexter but was unable to do so. When ...", "episode_rating": 8.1, "season_number": 8, "episode_number": 4, "episode_name": "Scar Tissue"}, {"episode_summary": "Dr. Vogel tells Dexter that Deb was traumatized when she tried to kill him. Now that she's hit rock bottom, things will improve. Dexter isn't too happy with either Vogel or Deb and ...", "episode_rating": 7.9, "season_number": 8, "episode_number": 5, "episode_name": "This Little Piggy"}, {"episode_summary": "Dexter is convinced that Zack Hamilton killed Norma Rivera but has no proof and takes to following him whenever he can. He's more than a bit surprised to follow him to Dr. Vogel's office. ...", "episode_rating": 7.7, "season_number": 8, "episode_number": 6, "episode_name": "A Little Reflection"}, {"episode_summary": "After being drugged by Hannah McKay, Dexter wakes up in an industrial area outside of town. He knows that Hannah is responsible and she's surprisingly easy to find, which makes Dexter more ...", "episode_rating": 7.4, "season_number": 8, "episode_number": 7, "episode_name": "Dress Code"}, {"episode_summary": "Dexter is certain that Zach Hamilton killed his next door neighbor Cassie, who is found bludgeoned to death in her apartment. The scene suggests that the crime was impulsive rather than ...", "episode_rating": 8.0, "season_number": 8, "episode_number": 8, "episode_name": "Are We There Yet?"}, {"episode_summary": "Dexter has decided to make a new life for himself with Hannah and Harrison but not before he takes care of the Brain Surgeon. In searching Zach Hamilton's photo studio he finds a clump of ...", "episode_rating": 7.1, "season_number": 8, "episode_number": 9, "episode_name": "Make Your Own Kind of Music"}, {"episode_summary": "Having made the decision that he and Harrison will move to Argentina with Hannah, Dexter has a lot to do. He tells Deb about his plan but that doesn't go over very well. He also tells Dr, ...", "episode_rating": 6.5, "season_number": 8, "episode_number": 10, "episode_name": "Goodbye Miami"}, {"episode_summary": "Still coming to terms with Dr. Vogel's death, Dexter wants to eliminate Oliver Saxon before he, Harrison and Hannah head off to South America. He also has a lot of personal items to tie up ...", "episode_rating": 6.9, "season_number": 8, "episode_number": 11, "episode_name": "Monkey in a Box"}, {"episode_summary": "Dexter has to act quickly when Hannah tells him Elway is staking out the airport. He finds a way to get him out of the way but it also leads to the entire airport being closed. With a ...", "episode_rating": 4.9, "season_number": 8, "episode_number": 12, "episode_name": "Remember the Monsters?"}]