[{"season_number": 1, "episode_name": "Echo", "episode_url": "http://www.imdb.com/title/tt1415018/", "episode_rating": 7.6, "episode_summary": "FBI Agent Paul Ballard searches for Caroline, a missing person, who may be connected to a Dollhouse. A place that people say doesn't exist.", "episode_number": 0}, {"season_number": 1, "episode_name": "Ghost", "episode_url": "http://www.imdb.com/title/tt1216522/", "episode_rating": 7.4, "episode_summary": "A wealthy backer asks the Dollhouse for help when his daughter is kidnapped. They send Echo to negotiate the release. One of the memory imprints used to prepare Echo for the mission causes some complications.", "episode_number": 1}, {"season_number": 1, "episode_name": "The Target", "episode_url": "http://www.imdb.com/title/tt1216523/", "episode_rating": 7.9, "episode_summary": "A man requests Echo as his companion on a camping trip, but his true intentions are far more deadly. More back story on the Dollhouse, Alpha, and Boyd's first encounter with Echo.", "episode_number": 2}, {"season_number": 1, "episode_name": "Stage Fright", "episode_url": "http://www.imdb.com/title/tt1216524/", "episode_rating": 7.1, "episode_summary": "Pop star Rayna is in need of protection due to death threats, so Echo is programmed as a backup singer/bodyguard for her. Sierra serves as additional protection. Paul's investigation into the Dollhouse might cost him his life.", "episode_number": 3}, {"season_number": 1, "episode_name": "Gray Hour", "episode_url": "http://www.imdb.com/title/tt1208132/", "episode_rating": 7.7, "episode_summary": "Echo's engagement to steal some art starts to go bad when she and others in her crew get locked in the vault. When Echo is wiped remotely, the Dollhouse must figure a way to get her out.", "episode_number": 4}, {"season_number": 1, "episode_name": "True Believer", "episode_url": "http://www.imdb.com/title/tt1216526/", "episode_rating": 7.4, "episode_summary": "Echo is programed to go under cover as a blind woman at religious cult in Arizona after a corrupt senator recruits Dollhouse to assist the ATF in the breakup of the cult. But with Boyd ...", "episode_number": 5}, {"season_number": 1, "episode_name": "Man on the Street", "episode_url": "http://www.imdb.com/title/tt1216525/", "episode_rating": 8.7, "episode_summary": "Ballard gets a lead on a possible Dollhouse client and he finds more than he expected. Meanwhile at the Dollhouse, an active is being abused, possibly by another active.", "episode_number": 6}, {"season_number": 1, "episode_name": "Echoes", "episode_url": "http://www.imdb.com/title/tt1216527/", "episode_rating": 7.9, "episode_summary": "Rossum Corporation asks the Dollhouse to send a large contingent of actives to a college campus to retrieve an experimental memory drug. The drug brings out suppressed memories which affect...", "episode_number": 7}, {"season_number": 1, "episode_name": "Needs", "episode_url": "http://www.imdb.com/title/tt1356321/", "episode_rating": 8.3, "episode_summary": "The Dollhouse's worst fears are realized as several actives awaken and remember some of their past lives and try to escape from the Dollhouse.", "episode_number": 8}, {"season_number": 1, "episode_name": "A Spy in the House of Love", "episode_url": "http://www.imdb.com/title/tt1356320/", "episode_rating": 8.6, "episode_summary": "DeWitt leaves Dominic in charge of the Dollhouse when she has to leave for a short period. Topher finds a chip in the imprint chair which has been used by other agencies to alter the ...", "episode_number": 9}, {"season_number": 1, "episode_name": "Haunted", "episode_url": "http://www.imdb.com/title/tt1356319/", "episode_rating": 7.8, "episode_summary": "Echo is imprinted with the memories of a deceased person, who wants to solve her own murder. Ballard digs deeper into Mellie's past. Topher needs an active to help him with his security check.", "episode_number": 10}, {"season_number": 1, "episode_name": "Briar Rose", "episode_url": "http://www.imdb.com/title/tt1356318/", "episode_rating": 8.7, "episode_summary": "Echo helps a troubled youth. Ballard finally locates the Dollhouse. He locates someone who designed the Dollhouse, now he's closer than ever to rescuing Caroline.", "episode_number": 11}, {"season_number": 1, "episode_name": "Omega", "episode_url": "http://www.imdb.com/title/tt1385113/", "episode_rating": 8.5, "episode_summary": "Alpha has taken Echo. More secrets of the Dollhouse are revealed. Ballard must work with the Dollhouse to stop Alpha, if he wants to save Caroline.", "episode_number": 12}, {"season_number": 1, "episode_name": "Epitaph One", "episode_url": "http://www.imdb.com/title/tt1417754/", "episode_rating": 8.9, "episode_summary": "In the future, the imprinting technology is rampant. A few people stumble on the Dollhouse.", "episode_number": 13}, {"season_number": 2, "episode_name": "Vows", "episode_url": "http://www.imdb.com/title/tt1472477/", "episode_rating": 7.7, "episode_summary": "Echo enters an assignment as a newlywed who is undercover trying to bring down an arms dealer. The Rossum corporation becomes a target of a senator. Dr. Saunders and Boyd discuss Dr. Saunders' personal conflict while she takes out her frustrations on Topher. Ballard gets in deeper with the Dollhouse.", "episode_number": 1}, {"season_number": 2, "episode_name": "Instinct", "episode_url": "http://www.imdb.com/title/tt1498132/", "episode_rating": 7.3, "episode_summary": "Echo is imprinted with the memory of a mother with a newborn baby for Dollhouse's latest business client. Complications arise when, thanks to Topher's programming, Echo takes too strongly ...", "episode_number": 2}, {"season_number": 2, "episode_name": "Belle Chose", "episode_url": "http://www.imdb.com/title/tt1484583/", "episode_rating": 7.8, "episode_summary": "A backer of the Dollhouse needs to talk to his nephew who was injured in a car accident. He wants to find some people who may have been abducted by his nephew.", "episode_number": 3}, {"season_number": 2, "episode_name": "Belonging", "episode_url": "http://www.imdb.com/title/tt1494936/", "episode_rating": 8.7, "episode_summary": "The story of how Sierra came to the Dollhouse is revealed. And leads to a shocking outcome.", "episode_number": 4}, {"season_number": 2, "episode_name": "The Public Eye", "episode_url": "http://www.imdb.com/title/tt1518945/", "episode_rating": 8.3, "episode_summary": "Senator Daniel Perrin breaks new ground in his attempt to expose the Dollhouse's secrets - by recruiting Madeline/November to testify before a Senate subcommittee. Rossum states that they ...", "episode_number": 5}, {"season_number": 2, "episode_name": "The Left Hand", "episode_url": "http://www.imdb.com/title/tt1518944/", "episode_rating": 8.6, "episode_summary": "Echo and Bennett have a shocking confrontation in which she reveals the reason for her grudge against Echo, while Adelle goes head-to-head with Stuart Lipman, the ruthless head of the ...", "episode_number": 6}, {"season_number": 2, "episode_name": "Meet Jane Doe", "episode_url": "http://www.imdb.com/title/tt1535688/", "episode_rating": 8.0, "episode_summary": "After her entanglements with Senator Perrin and the DC Dollhouse, Echo finds herself out in the world-at-large as she struggles to control her multiple memory downloads, as well as those of...", "episode_number": 7}, {"season_number": 2, "episode_name": "A Love Supreme", "episode_url": "http://www.imdb.com/title/tt1535687/", "episode_rating": 8.5, "episode_summary": "When all of Echo's past romantic engagements are found murdered, Adelle and the rest of the staff of the Dollhouse fear that Alpha has returned to seek his revenge. Adelle begins to grow ...", "episode_number": 8}, {"season_number": 2, "episode_name": "Stop-Loss", "episode_url": "http://www.imdb.com/title/tt1535689/", "episode_rating": 8.0, "episode_summary": "Victor's five-year contract with the Dollhouse elapses and he goes back out into the real world under his old personality of Anthony Ceccoli. But his past as a soldier fighting in ...", "episode_number": 9}, {"season_number": 2, "episode_name": "The Attic", "episode_url": "http://www.imdb.com/title/tt1535690/", "episode_rating": 8.8, "episode_summary": "We finally enter the mysterious Attic - the secret vault where the Dollhouse keeps damaged actives and problematic employees unconscious and in a perpetual state of terror. Adelle has had ...", "episode_number": 10}, {"season_number": 2, "episode_name": "Getting Closer", "episode_url": "http://www.imdb.com/title/tt1537128/", "episode_rating": 8.8, "episode_summary": "With the Rossum conspiracy now fully revealed, Echo and her allies must now make their stand to stop the Rossum Corporation from enslaving the free world with their newest remote mind-wipe ...", "episode_number": 11}, {"season_number": 2, "episode_name": "The Hollow Men", "episode_url": "http://www.imdb.com/title/tt1537129/", "episode_rating": 8.5, "episode_summary": "Still unaware of a traitor in their midst, the dollhouse survivors flee Los Angeles for Rossum's headquarters in Tucson, where they hope to prevent the apocalyptic future.", "episode_number": 12}, {"season_number": 2, "episode_name": "Epitaph Two: Return", "episode_url": "http://www.imdb.com/title/tt1537130/", "episode_rating": 8.8, "episode_summary": "In the year 2020, events finally come full-circle as Echo and the few surviving Dollhouse staff struggle to restore mankind after the devastating events seen in the first season episode, \"...", "episode_number": 13}]