[{"episode_name": "Premiere", "episode_summary": "Astronaut John Crichton's \"Farscape-1\" space module is swallowed by a wormhole and spat out on the other side of the universe into the middle of a space battle. Taken on board \"Moya\", a ...", "episode_number": 1, "episode_rating": 7.8, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0187844/"}, {"episode_name": "Exodus from Genesis", "episode_summary": "Moya is invaded by some creatures. They increase the heat on Moya, and they're creating replicas of the crew. Peacekeeper cannot stand heat, Aeryn starts to suffer Heat Delirium. The crew ...", "episode_number": 2, "episode_rating": 7.2, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578086/"}, {"episode_name": "Back and Back and Back to the Future", "episode_summary": "The crew rescues a scientist and his assistant from a disintegrating ship. Crichton starts seeing the future, which holds death for the crew and Moya. He tries to influence the course of events but cannot change the outcome until they all learn what their guests are truly hiding.", "episode_number": 3, "episode_rating": 6.6, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578072/"}, {"episode_name": "Throne for a Loss", "episode_summary": "Rygel is captured and held for ransom by some bounty hunters. Rygel \"borrowed\" a crystal from Moya, without the crystal Moya cannot maintain her orbit and will crash into the planet if it isn't returned shortly.", "episode_number": 4, "episode_rating": 7.8, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578141/"}, {"episode_name": "PK Tech Girl", "episode_summary": "After finding the legendary Peacekeeper battleship, Zelbinion, dead in space and emptied of most of its useful technologies Crichton, Aeryn, and D'Argo find a Peacekeeper tech under Crais's...", "episode_number": 5, "episode_rating": 6.4, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578116/"}, {"episode_name": "Thank God It's Friday, Again", "episode_summary": "D'Argo goes into a hyper rage and seeks out Crichton, thinking he left the ship for a nearby planet, he pursues his quarry. The crew then searches for D'Argo. When they find him, they find ...", "episode_number": 6, "episode_rating": 6.7, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578131/"}, {"episode_name": "I, E.T.", "episode_summary": "The removal of Moya's control collar activates a homing signal. Pilot manages to mask it by landing Moya in a swamp, unsure if a Leviathan can land on a planet or take off again. They ...", "episode_number": 7, "episode_rating": 6.9, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578091/"}, {"episode_name": "That Old Black Magic", "episode_summary": "Crichton's spirit is captured by Maldis. The sorcerer thrives on vengeance and hate, he brings Crais's spirit down. And the two spirits battle. Zhaan can fight Maldis, but if she fights Maldis, she must take a dark path.", "episode_number": 8, "episode_rating": 7.9, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578133/"}, {"episode_name": "DNA Mad Scientist", "episode_summary": "A scientist claims to have maps to large parts of the galaxy. And offers the crew a map to get to their respective homes. In exchange for the map, he wants some genetic material, he wants ...", "episode_number": 9, "episode_rating": 8.3, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578080/"}, {"episode_name": "They've Got a Secret", "episode_summary": "D'Argo falls down a shaft and accidentally breaks something. He becomes disoriented, and sees the crew as someone from his past, his wife, their son, and her killer. The crew must get ...", "episode_number": 10, "episode_rating": 6.7, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578140/"}, {"episode_name": "Till the Blood Runs Clear", "episode_summary": "While flying Crichton's ship near a sun with high flare activity, John and Aeryn narrowly avoid getting sucked into an unstable wormhole. In an attempt to save his damaged ship, he sets ...", "episode_number": 11, "episode_rating": 7.2, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578143/"}, {"episode_name": "The Flax", "episode_summary": "Aeryn takes Crichton out in a transport pod for flying lessons, they get stuck in the Flax, a space trap. To make some critical repairs, they must depressurize the pod, but there is only ...", "episode_number": 12, "episode_rating": 7.2, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578135/"}, {"episode_name": "Rhapsody in Blue", "episode_summary": "The crew finds a colony of Delvians. Z'han goes down to be with her own people for a while, but one of them wants something from Z'han and will do almost anything to take it from her.", "episode_number": 13, "episode_rating": 6.9, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578123/"}, {"episode_name": "Jeremiah Crichton", "episode_summary": "Crichton is getting frustrated in his new environment. He takes his ship out for a quick jaunt, but Moya's pregnancy is causing some changes in the Leviathan, she starbursts suddenly ...", "episode_number": 14, "episode_rating": 6.7, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578098/"}, {"episode_name": "Durka Returns", "episode_summary": "Moya collides with a Nebari transport. A Nebari official was transporting 2 criminals. Chiana, a Nebari youth. And Durka, a Legendary Peacekeeper who once tortured Rygel. The official ...", "episode_number": 15, "episode_rating": 8.6, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578084/"}, {"episode_name": "A Human Reaction", "episode_summary": "A wormhole appears before Moya, the crew can see Earth on the other side. Crichton flies down the wormhole to the world he left behind. But when the rest of the crew comes looking for him, ...", "episode_number": 16, "episode_rating": 8.2, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578070/"}, {"episode_name": "Through the Looking Glass", "episode_summary": "Since the Moya can no longer Starburst, the crew doesn't feel they are safe on the Leviathan. Fearing the crew will leave, Moya attempts a Starburst. The crew is now separated on 3 ...", "episode_number": 17, "episode_rating": 6.7, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578142/"}, {"episode_name": "A Bug's Life", "episode_summary": "The crew encounters a group of Peacekeeper who have just captured a dangerous creature. An entity that can take control of someone with just a touch. The Peacekeepers want to take it to a ...", "episode_number": 18, "episode_rating": 8.3, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578067/"}, {"episode_name": "Nerve", "episode_summary": "Aeryn has been critically wounded. She needs some tissue samples to heal. The only source is the Secret base the Peacekeeper mentioned. Crichton and Chiana go to the base, to get the samples. They encounter an old friend, and a new enemy.", "episode_number": 19, "episode_rating": 8.0, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578114/"}, {"episode_name": "The Hidden Memory", "episode_summary": "Aeryn is cured, but Crichton has been captured. Now the crew struggles to find a way to rescue him. Scorpius probes Crichton for wormhole knowledge, and discovers something left behind by ...", "episode_number": 20, "episode_rating": 8.0, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578136/"}, {"episode_name": "Bone to Be Wild", "episode_summary": "The crew find a planetoid that's a botanical paradise. Occupied by a scientist and a peaceful girl. But one is a killer. And there's more to this paradise than they realized. One of them wants Z'han for their own agenda.", "episode_number": 21, "episode_rating": 8.1, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578075/"}, {"episode_name": "Family Ties", "episode_summary": "With death approaching in the form of Peacekeeper search parties, those aboard Moya say their final goodbyes, and share a last feast together, before enacting a plan to save Moya and her baby, named Talyn.", "episode_number": 22, "episode_rating": 8.0, "season_number": 1, "episode_url": "http://www.imdb.com/title/tt0578087/"}, {"episode_name": "Mind the Baby", "episode_summary": "Aeryn has managed to rescue D'Argo and Crichton, they're hiding in an asteroid belt. But she needed help from Crais and Talyn to rescue them. Even as she's checking on her friends, she's ...", "episode_number": 1, "episode_rating": 7.2, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578111/"}, {"episode_name": "Vitas Mortis", "episode_summary": "The crew finds a dying Orican, a Luxan holy woman. She asks D'Argo to help her with a ceremony. She tests D'Argo's worthiness, and throws him out saying he's not worthy. He explains to his ...", "episode_number": 2, "episode_rating": 6.8, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578146/"}, {"episode_name": "Taking the Stone", "episode_summary": "Upon learning of her brother's death, Chiana leaves Moya in Aeryn's Prowler. Crichton and Aeryn find her on royal burial grounds living with a group of people with some strange customs, ...", "episode_number": 3, "episode_rating": 6.3, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578129/"}, {"episode_name": "Crackers Don't Matter", "episode_summary": "A visitor comes on Moya with a device that could cloak Moya. The crew welcomes him on board, but soon almost everyone is acting paranoid, and the crew starts attacking each other.", "episode_number": 4, "episode_rating": 8.0, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578078/"}, {"episode_name": "The Way We Weren't", "episode_summary": "Chiana discovers a recording with Moya's original Pilot. After seeing the recording and realizing Aeryn was involved, Pilot orders Aeryn to leave Moya.", "episode_number": 5, "episode_rating": 8.1, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578139/"}, {"episode_name": "Picture If You Will", "episode_summary": "Chiana buys a picture in a store, which is more than it seems. The picture is changes and shows Chiana what will happen to her, when it shows she is on fire, the crew must discover the origins of the picture, and find an old enemy.", "episode_number": 6, "episode_rating": 8.0, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578117/"}, {"episode_name": "Home on the Remains", "episode_summary": "The crew needs food. Zahn needs to eat meat, she starts spewing spores. Only Aeryn seems to have an tolerance for the spores. While she's on Moya with Zahn, the others find a Budong to get some food.", "episode_number": 7, "episode_rating": 6.6, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578089/"}, {"episode_name": "Dream a Little Dream", "episode_summary": "While waiting for Moya to pick their Transport Pod, Zahn tells Crichton of Moya's adventures after the Gammeck base was destroyed. Zahn was on trial for murder, with Chiana, and Rygel acting as her defense lawyers.", "episode_number": 8, "episode_rating": 6.7, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578083/"}, {"episode_name": "Out of Their Minds", "episode_summary": "The crew is attacked by a vessel, Zahn goes over to the ship to negotiate a peace. But the ship attacks again, the attack reacts unexpectedly interacts with the shields causing everyone on ...", "episode_number": 9, "episode_rating": 6.9, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578115/"}, {"episode_name": "My Three Crichtons", "episode_summary": "An energy ball enters Moya, and comes into contact with everyone on board. When it reaches Crichton, it engulfs him, then a cave man comes out, followed by Crichton. Blood tests show the ...", "episode_number": 10, "episode_rating": 7.8, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578112/"}, {"episode_name": "Look at the Princess: Part 1: A Kiss Is But a Kiss", "episode_summary": "The crew rests on a planet where the successor to the throne needs a genetically compatible mate to take the throne. She finds her mate ... in Crichton. But someone else wants the throne, ...", "episode_number": 11, "episode_rating": 6.9, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578105/"}, {"episode_name": "Look at the Princess: Part 2: I Do, I Think", "episode_summary": "The Queen offers Crichton a choice; marry her daughter the crown princess, or she'll turn him over to Scorpius. Meanwhile, Moya has found her builders, the ones who created Leviathans. They...", "episode_number": 12, "episode_rating": 6.9, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578106/"}, {"episode_name": "Look at the Princess: Part 3: The Maltese Crichton", "episode_summary": "Crichton has been turned into a statue. Now someone has cut off his head, and everyone searches for it. Once it's reattached, he finds out he cannot be turned into a statue again, he ...", "episode_number": 13, "episode_rating": 7.9, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578107/"}, {"episode_name": "Beware of Dog", "episode_summary": "Chiana returns from a Commerce Planet with a cute little creature called a Vorc that is said to be capable of hunting down parasites which may have inadvertently come on board with the ...", "episode_number": 14, "episode_rating": 7.5, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578074/"}, {"episode_name": "Won't Get Fooled Again", "episode_summary": "Crichton has returned to Earth. Or has he always been on Earth all this time? People from his past and present appear. Is this some trick, if so who is behind it and why.", "episode_number": 15, "episode_rating": 6.9, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578152/"}, {"episode_name": "The Locket", "episode_summary": "The crew finds a cloudy area where they might be able to hide from Peacekeepers. Aeryn goes into the area to check it out. She returns a few hours later, much older. And tells them to leave...", "episode_number": 16, "episode_rating": 7.2, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578137/"}, {"episode_name": "The Ugly Truth", "episode_summary": "A ship is destroyed by Talyn while Moya's crew is aboard. Talyn, with Crais, starburst away while the rest are captured by another ship. Each member of the crew is interrogated in turn. The...", "episode_number": 17, "episode_rating": 7.9, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578138/"}, {"episode_name": "A Clockwork Nebari", "episode_summary": "Rygel and Aeryn return from a planet to Moya accompanied by another Nebari who aims to take Chiana back. The crew is temporarily mind-cleansed except the Pilot but they put a collar on him ...", "episode_number": 18, "episode_rating": 8.4, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578068/"}, {"episode_name": "Liars, Guns and Money: Part 1: A Not So Simple Plan", "episode_summary": "D'Argo finally gets a lead on his son, Jothee. He will do anything to get him back, but Jothee will be sold as a slave. They need a lot of money to buy Jothee's freedom. The crew will steal from a depository to get the money they need to free Jothee. Stark, back from the dead, is the author of the plan.", "episode_number": 19, "episode_rating": 8.0, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578102/"}, {"episode_name": "Liars, Guns and Money: Part 2: With Friends Like These...", "episode_summary": "Scorpius bought the lot with D'Argo's son just before Moya arrived and demands Crichton in exchange for Jothee. They plan to buy help of the beings they encountered before to break into ...", "episode_number": 20, "episode_rating": 7.9, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578103/"}, {"episode_name": "Liars, Guns and Money: Part 3: Plan B", "episode_summary": "The crew is going to break into the depository to free Crichton. Crichton is being tortured for wormhole technology. Nothing is going like planned with those mercenaries but unexpected arrival of Talyn helps them to break free. They get rid of Scorpius but their losses are too big, among which Crichton's sanity.", "episode_number": 21, "episode_rating": 8.0, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578104/"}, {"episode_name": "Die Me, Dichotomy", "episode_summary": "The neural chip in Crichton's head is driving him insane. He pleads with D'Argo to kill him. They take him to a healer to have the chip removed. The chip takes control of Crichton, and ...", "episode_number": 22, "episode_rating": 8.1, "season_number": 2, "episode_url": "http://www.imdb.com/title/tt0578081/"}, {"episode_name": "Season of Death", "episode_summary": "Crichton lies on the operating table with the neural chip removed, unable to communicate. Aeryn's cryogenic-ally frozen. The surgeon is able to restore Crichton's ability to speak. A ...", "episode_number": 1, "episode_rating": 7.7, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578125/"}, {"episode_name": "Suns and Lovers", "episode_summary": "The crew relaxes on a space station. D'Argo wants to propose to Chiana, but something will affect his relationship with those closest/dearest to him. A fanatic has a device to attract solar...", "episode_number": 2, "episode_rating": 6.7, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578128/"}, {"episode_name": "Self Inflicted Wounds: Part 1 - Could'a, Would'a, Should'a", "episode_summary": "The crew searches for a planet where they can plant Zahn, so that she can recover. They encounter a wormhole and stop to investigate. A ship emerges from the wormhole and collides with Moya...", "episode_number": 3, "episode_rating": 6.7, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578126/"}, {"episode_name": "Self Inflicted Wounds: Part 2 - Wait for the Wheel", "episode_summary": "The two ships are still linked together. The crews are being attacked by a strange creature, Moya's taking a heavy beating. Crichton finds a transmission from Earth. The ships will finally ...", "episode_number": 4, "episode_rating": 7.9, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578127/"}, {"episode_name": "...Different Destinations", "episode_summary": "Moya's crew tries to relax on planet. A device unexpectedly reacts with Stark, and they get sent back in time. The crew must figure a way to get history back on course. This is not a ...", "episode_number": 5, "episode_rating": 6.7, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578066/"}, {"episode_name": "Eat Me", "episode_summary": "Upon arriving at the rendezvous coordinates with minimal life support in their transport pod, Crichton, D'Argo, Chiana, and Jool are forced to dock with a nearby Leviathan bearing a ...", "episode_number": 6, "episode_rating": 7.3, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578085/"}, {"episode_name": "Thanks for Sharing", "episode_summary": "The crew tend to Crais and Talyn. Both are badly injured. The 2 Crichtons try to adjust to life with each other. The crew gets embroiled in a political situation while trying to buy ...", "episode_number": 7, "episode_rating": 7.2, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578132/"}, {"episode_name": "Green Eyed Monster", "episode_summary": "While Rygel and Stark are out scouting the area, Talyn, still recovering from the Peacekeeper attack, is swallowed by a Budong. John and Aeryn attempt to \"lay anchor\" by catching grappling ...", "episode_number": 8, "episode_rating": 7.9, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0756866/"}, {"episode_name": "Losing Time", "episode_summary": "Upon passing through an electromagnetic cluster, Crichton sees a strange being aboard Moya. It seems to attack him, causing him to black out and bleed profusely. However he cannot prove his...", "episode_number": 9, "episode_rating": 7.0, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578108/"}, {"episode_name": "Relativity", "episode_summary": "While Talyn is resting on a planet with high gravity he senses the retrieval squad, led by Aeryn's mother, setting down nearby. John, Aeryn, and Crais head out to confront the Peacekeepers ...", "episode_number": 10, "episode_rating": 7.9, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578121/"}, {"episode_name": "Incubator", "episode_summary": "Scorpius puts the neural chip in his head to unlock the wormhole knowledge in the chip. He shows his origin to residual memory of Crichton that's been embedded in the chip in an effort to ...", "episode_number": 11, "episode_rating": 7.9, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578093/"}, {"episode_name": "Meltdown", "episode_summary": "Back on Talyn, John is trying to figure out whether Crais let Aeryn's mother, Xhalax, live in order to save his own skin, but is interrupted when Talyn goes head first towards the nearby ...", "episode_number": 12, "episode_rating": 7.2, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578109/"}, {"episode_name": "Scratch 'N Sniff", "episode_summary": "D'Argo and Crichton are constantly arguing with each other. Tired of the arguing, Pilot banishes both of them from Moya for 10 days. They return to Moya sooner than expected. They tell them...", "episode_number": 13, "episode_rating": 6.8, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578124/"}, {"episode_name": "Infinite Possibilities: Part 1 - Daedalus Demands", "episode_summary": "A wormhole appears near Talyn. Crichton realizes it's \"Jack\" the ancient whom he encountered earlier. The ancients have found a new home, the ancients are worried about the misuse of ...", "episode_number": 14, "episode_rating": 6.9, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578094/"}, {"episode_name": "Infinite Possibilities: Part 2 - Icarus Abides", "episode_summary": "Jack now trusts Crichton, and has unlocked the wormhole knowledge in Crichton's head. Now they race to build a weapon to fend of approaching Scarrans. But an opposing force is even closer ...", "episode_number": 15, "episode_rating": 8.0, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578095/"}, {"episode_name": "Revenging Angel", "episode_summary": "D'Argo injures Crichton, as Crichton lies in a coma/near death, he escapes into a highly animated world. It's Farscape, Chuck Jones/Loony Tunes style. Meanwhile D'Argo's actions create a crisis on Moya, which could destroy the Leviathan", "episode_number": 16, "episode_rating": 7.2, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578122/"}, {"episode_name": "The Choice", "episode_summary": "Aeryn is devastated. She leaves Talyn, and grieves on a planet. Talyn's crew tries to help but she doesn't want their help. She spots someone who might be her father. But not all family reunions are joyous.", "episode_number": 17, "episode_rating": 7.9, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578134/"}, {"episode_name": "Fractures", "episode_summary": "Moya and Talyn's crew reunite at last. Aeryn is still getting over her loss, and cannot face Crichton. Moya rescues some Peacekeeper prisoners but at least one of them still works for the ...", "episode_number": 18, "episode_rating": 7.0, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578088/"}, {"episode_name": "I-Yensch, You-Yensch", "episode_summary": "Rygel and D'Argo meet with Scorpius and Braca to negotiate a deal. So that the crew can board the command carrier. 2 would-be-robbers interrupt the bargaining process, now they're forced to...", "episode_number": 19, "episode_rating": 6.7, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578092/"}, {"episode_name": "Into the Lion's Den: Part 1 - Lambs to the Slaughter", "episode_summary": "The crew must stop Scorpius's research on wormhole technology. The only way to stop him is to board the command carrier and figure a way to destroy it from within.", "episode_number": 20, "episode_rating": 8.0, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578096/"}, {"episode_name": "Into the Lion's Den: Part 2 - Wolf in Sheep's Clothing", "episode_summary": "The crew has been captured, Crais betrayed them. Now Scorpius is threatening Earth. Crichton must help him develop wormhole weapons or he'll wipe out Earth. Crichton has no choice but to ...", "episode_number": 21, "episode_rating": 8.5, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578097/"}, {"episode_name": "Dog with Two Bones", "episode_summary": "Moya wants Talyn's remains in a sacred Leviathan place. But another Leviathan won't allow it. The crew's last mission together is to help fulfill Moya's wishes. After that, everyone goes ...", "episode_number": 22, "episode_rating": 6.7, "season_number": 3, "episode_url": "http://www.imdb.com/title/tt0578082/"}, {"episode_name": "Crichton Kicks", "episode_summary": "It's been several months. Since the crew disbanded, and Moya was sucked down a wormhole. Crichton is now on board aged Leviathan, working on wormholes. But some visitor arrive who want to ...", "episode_number": 1, "episode_rating": 6.7, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578079/"}, {"episode_name": "What Was Lost: Part 1 - Sacrifice", "episode_summary": "Everyone but Aeryn meets on Arnesk. Where Jool has discovered the remains of an ancient civilization.", "episode_number": 2, "episode_rating": 6.9, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578150/"}, {"episode_name": "What Was Lost: Part 2 - Resurrection", "episode_summary": "The crew discovers how far Scorpius has fallen in the Peacekeeper ranks. They must find and activate all the probes to stop the magnetic storm on Arnesk, but someone doesn't want them stopped.", "episode_number": 3, "episode_rating": 7.0, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578151/"}, {"episode_name": "Lava's a Many Splendored Thing", "episode_summary": "The crew is on the way to rendezvous with Moya. After ingesting a concoction of Noranti's they stop for a break on a planet. Rygel is captured and entombed in amber by raiders.", "episode_number": 4, "episode_rating": 8.2, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578101/"}, {"episode_name": "Promises", "episode_summary": "Everyone finally reunites on Moya. But Aeryn returns with Scorpius, who claims to have saved the former Peacekeeper's life. Aeryn forces them to accept Scorpius on board, and another crisis...", "episode_number": 5, "episode_rating": 7.1, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578120/"}, {"episode_name": "Natural Election", "episode_summary": "Pilot and Moya ask the crew to elect a Captain. They each take turns, a crisis arises when John finally summons a wormhole. Something attach itself to Moya. Aeryn's secret is revealed, but ...", "episode_number": 6, "episode_rating": 6.6, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578113/"}, {"episode_name": "John Quixote", "episode_summary": "Crichton and Chiana get stuck in a video game where they encounter strange/twisted versions of their friends. They must figure how to beat the game, or they'll be stuck inside forever. The ...", "episode_number": 7, "episode_rating": 6.7, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578099/"}, {"episode_name": "I Shrink Therefore I Am", "episode_summary": "Bounty Hunters capture most of the crew. Only John and Noranti are free. Crichton must work with Scorpius to save the crew. When the bounty hunters shrink the crew, and hold them in ...", "episode_number": 8, "episode_rating": 8.3, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578090/"}, {"episode_name": "A Prefect Murder", "episode_summary": "While Moya and her crew are resupplying on a generally xenophobic planet, Aeryn kills the next prefect, along with many bystanders and D'Argo, while under a strange form of suggestion.", "episode_number": 9, "episode_rating": 7.3, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578071/"}, {"episode_name": "Coup by Clam", "episode_summary": "The crew gets checked out by a doctor for Space madness, a condition that's common in the area they're traveling. He gives them some food after the exam, and after they've ingested the meal...", "episode_number": 10, "episode_rating": 6.6, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578077/"}, {"episode_name": "Unrealized Reality", "episode_summary": "Crichton finds a wormhole, and studies with interest in his space suit, and gets pulled inside. He meets Einstein, and exposes Crichton to different realities to showcase the full potential...", "episode_number": 11, "episode_rating": 6.7, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578145/"}, {"episode_name": "Kansas", "episode_summary": "Crichton has returned to Earth, but it's the 80's. And Crichton's father is supposed to fly the ill fated Challenger mission. They must save his father, or everyone on Moya will never have ...", "episode_number": 12, "episode_rating": 7.9, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578100/"}, {"episode_name": "Terra Firma", "episode_summary": "Crichton has arrived home, on Earth. Even though the Moya crew relaxes, on Earth and are treated as VIPs, Crichton can't seem to adjust to life on Earth. After all his adventures, can he still call Earth his home?", "episode_number": 13, "episode_rating": 6.5, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578130/"}, {"episode_name": "Twice Shy", "episode_summary": "The crew goes into Tormented Space, where they hope to avoid both the Peacekeepers and Scarrans. The crew buys maps for the area, Chiana buys a slave girl and sets her free. The crew tries ...", "episode_number": 14, "episode_rating": 7.0, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578144/"}, {"episode_name": "Mental as Anything", "episode_summary": "The males of the crew undergo some training. Crichton learns how to resist Scarran probes. While D'Argo learns some self control D'Argo encounters his wife's murderer, his wife's brother.", "episode_number": 15, "episode_rating": 8.1, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578110/"}, {"episode_name": "Bringing Home the Beacon", "episode_summary": "The girls are out looking for an item that will camouflage Moya from long-range scans on an outpost in Tormented Space. While they are waiting for their part, they spot Braca and Grayza ...", "episode_number": 16, "episode_rating": 7.1, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578076/"}, {"episode_name": "A Constellation of Doubt", "episode_summary": "John Crichton struggles to learn the location of the mysterious Katratzi, whilst watching a television documentary about himself and the aliens.", "episode_number": 17, "episode_rating": 7.9, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578069/"}, {"episode_name": "Prayer", "episode_summary": "Aeryn has been captured by the Scarrans. The Scarrans realize they no longer need Crichton for wormhole technology. They can gain the knowledge from Aeryn's child. If the child is really ...", "episode_number": 18, "episode_rating": 7.9, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578118/"}, {"episode_name": "We're So Screwed: Part 1: Fetal Attraction", "episode_summary": "The crew goes after Aeryn on a Scarran controlled station.", "episode_number": 19, "episode_rating": 7.9, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578147/"}, {"episode_name": "We're So Screwed: Part 2: Hot to Katratzi", "episode_summary": "The crew has managed to rescue Aeryn, but Scorpius was captured. Fearing he might reveal wormhole technology to the Scarrans, the crew must rescue him. As the Peacekeepers, and Scarrans, ...", "episode_number": 20, "episode_rating": 8.0, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578148/"}, {"episode_name": "We're So Screwed: Part 3: La Bomba", "episode_summary": "Scorpius has betrayed the crew. Now they're all captured. Their plan failed, the crew has little choice but to help Scorpius's true agenda.", "episode_number": 21, "episode_rating": 8.0, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578149/"}, {"episode_name": "Bad Timing", "episode_summary": "The Scarrans know where the Wormhole to Earth is, and they're on their way. Crichton and crew race to the wormhole to stop them. But saving the Earth means destroying the chance for John to...", "episode_number": 22, "episode_rating": 6.7, "season_number": 4, "episode_url": "http://www.imdb.com/title/tt0578073/"}]