[{"episode_rating": 8.9, "episode_summary": "Jon Arryn, the Hand of the King, is dead. King Robert Baratheon plans to ask his oldest friend, Eddard Stark, to take Jon's place. Across the sea, Viserys Targaryen plans to wed his sister to a nomadic warlord in exchange for an army.", "episode_url": "http://www.imdb.com/title/tt1480055/", "episode_number": 1, "season_number": 1, "episode_name": "Winter Is Coming"}, {"episode_rating": 8.8, "episode_summary": "While Bran recovers from his fall, Ned takes only his daughters to Kings Landing. Jon Snow goes with his uncle Benjen to The Wall. Tyrion joins them.", "episode_url": "http://www.imdb.com/title/tt1668746/", "episode_number": 2, "season_number": 1, "episode_name": "The Kingsroad"}, {"episode_rating": 8.6, "episode_summary": "Lord Stark and his daughters arrive at King's Landing to discover the intrigues of the king's realm.", "episode_url": "http://www.imdb.com/title/tt1829962/", "episode_number": 3, "season_number": 1, "episode_name": "Lord Snow"}, {"episode_rating": 8.7, "episode_summary": "Eddard investigates Jon Arryn's murder. Jon befriends Samwell Tarly, a coward who has come to join the Night's Watch.", "episode_url": "http://www.imdb.com/title/tt1829963/", "episode_number": 4, "season_number": 1, "episode_name": "Cripples, Bastards, and Broken Things"}, {"episode_rating": 9.0, "episode_summary": "Catelyn has captured Tyrion and plans to bring him to her sister, Lysa Arryn, at The Vale, to be tried for his, supposed, crimes against Bran. Robert plans to have Daenerys killed, but Eddard refuses to be a part of it and quits.", "episode_url": "http://www.imdb.com/title/tt1829964/", "episode_number": 5, "season_number": 1, "episode_name": "The Wolf and the Lion"}, {"episode_rating": 9.1, "episode_summary": "While recovering from his battle with Jamie, Eddard is forced to run the kingdom while Robert goes hunting. Tyrion demands a trial by combat for his freedom. Viserys is losing his patience with Drogo.", "episode_url": "http://www.imdb.com/title/tt1837862/", "episode_number": 6, "season_number": 1, "episode_name": "A Golden Crown"}, {"episode_rating": 9.2, "episode_summary": "Robert has been injured while hunting and is dying. Jon and the others finally take their vows to the Night's Watch. A man, sent by Robert, is captured for trying to poison Daenerys. Furious, Drogo vows to attack the Seven Kingdoms.", "episode_url": "http://www.imdb.com/title/tt1837863/", "episode_number": 7, "season_number": 1, "episode_name": "You Win or You Die"}, {"episode_rating": 9.0, "episode_summary": "Eddard and his men are betrayed and captured by the Lannisters. When word reaches Robb, he plans to go to war to rescue them. The White Walkers attack The Wall. Tyrion returns to his father with some new friends.", "episode_url": "http://www.imdb.com/title/tt1837864/", "episode_number": 8, "season_number": 1, "episode_name": "The Pointy End"}, {"episode_rating": 9.4, "episode_summary": "Robb goes to war against the Lannisters. Jon finds himself struggling on deciding if his place is with Robb or the Night's Watch. Drogo has fallen ill from a fresh battle wound. Daenerys is desperate to save him.", "episode_url": "http://www.imdb.com/title/tt1851398/", "episode_number": 9, "season_number": 1, "episode_name": "Baelor"}, {"episode_rating": 9.4, "episode_summary": "With Ned dead, Robb vows to get revenge on the Lannnisters. Jon must officially decide if his place is with Robb or the Night's Watch. Daenerys says her final goodbye to Drogo.", "episode_url": "http://www.imdb.com/title/tt1851397/", "episode_number": 10, "season_number": 1, "episode_name": "Fire and Blood"}, {"episode_rating": 8.8, "episode_summary": "Tyrion arrives at Kings Landing to take his father's place as Hand of the King. Stannis Baratheon plans to take the Iron Throne for his own. Robb tries to decide his next move in the war. The Night's Watch arrive at the house of Craster.", "episode_url": "http://www.imdb.com/title/tt1971833/", "episode_number": 1, "season_number": 2, "episode_name": "The North Remembers"}, {"episode_rating": 8.4, "episode_summary": "Arya makes friends with Gendry. Tyrion tries to take control of the small council. Theon arrives at his home, Pyke, in order to persuade his father into helping Robb with the war. Jon tries to investigate Craster's secret.", "episode_url": "http://www.imdb.com/title/tt2069318/", "episode_number": 2, "season_number": 2, "episode_name": "The Night Lands"}, {"episode_rating": 8.8, "episode_summary": "Tyrion tries to see who he can trust in the small council. Catelyn visits Renly to try and persuade him to join Robb in the war. Theon must decide if his loyalties lie with his own family or with Robb.", "episode_url": "http://www.imdb.com/title/tt2070135/", "episode_number": 3, "season_number": 2, "episode_name": "What Is Dead May Never Die"}, {"episode_rating": 8.8, "episode_summary": "Lord Baelish arrives at Renly's camp just before he faces off against Stannis. Daenerys and her company are welcomed into the city of Qarth. Arya, Gendry, and Hot Pie find themselves imprisoned at Harrenhal.", "episode_url": "http://www.imdb.com/title/tt2069319/", "episode_number": 4, "season_number": 2, "episode_name": "Garden of Bones"}, {"episode_rating": 8.8, "episode_summary": "Renly is dead, and his army has merged with Stannis. Tyrion investigates a secret weapon that King Joffery plans to use against Stannis. Meanwhile, as a token for saving his life, Jaqen H'ghar offers to kill three people that Arya chooses.", "episode_url": "http://www.imdb.com/title/tt2074658/", "episode_number": 5, "season_number": 2, "episode_name": "The Ghost of Harrenhal"}, {"episode_rating": 8.9, "episode_summary": "Theon seizes control of Winterfell. Jon captures a wildling, named Ygritte. The people of King's Landing begin to turn against King Joffery. Daenerys looks to buy ships to sail for the Seven Kingdoms.", "episode_url": "http://www.imdb.com/title/tt2085238/", "episode_number": 6, "season_number": 2, "episode_name": "The Old Gods and the New"}, {"episode_rating": 8.9, "episode_summary": "Bran and Rickon have escaped Winterfell. Theon tries to hunt them down. Daenerys' dragons have been stolen. Jon travels through the wilderness with Ygritte as his prisoner. Sansa has bled and is now ready to have Joffery's children.", "episode_url": "http://www.imdb.com/title/tt2085239/", "episode_number": 7, "season_number": 2, "episode_name": "A Man Without Honor"}, {"episode_rating": 8.8, "episode_summary": "Stannis is just days from King's Landing. Tyrion prepares for his arrival. Jon and Qhorin are taken prisoner by the wildlings. Catelyn is arrested for releasing Jamie. Arya, Gendry, and Hot Pie plan to escape from Harrenhal.", "episode_url": "http://www.imdb.com/title/tt2085240/", "episode_number": 8, "season_number": 2, "episode_name": "The Prince of Winterfell"}, {"episode_rating": 9.6, "episode_summary": "Stannis has arrived at King's Landing. The battle has come!", "episode_url": "http://www.imdb.com/title/tt2084342/", "episode_number": 9, "season_number": 2, "episode_name": "Blackwater"}, {"episode_rating": 9.4, "episode_summary": "Joffrey names Tywin the new Hand of the King. Robb marries Talisa Maegyr. Jon prepares to meet Mance Rayder. Arya says farewell to Jaqen H'ghar. Daenerys tries to rescue her dragons.", "episode_url": "http://www.imdb.com/title/tt2112510/", "episode_number": 10, "season_number": 2, "episode_name": "Valar Morghulis"}, {"episode_rating": 8.7, "episode_summary": "Jon is brought before Mance Rayder, the King Beyond the Wall, while the Night's Watch survivors retreat south. In King's Landing, Tyrion asks for his reward. Littlefinger offers Sansa a way out.", "episode_url": "http://www.imdb.com/title/tt2178782/", "episode_number": 1, "season_number": 3, "episode_name": "Valar Dohaeris"}, {"episode_rating": 8.5, "episode_summary": "Bran and company meet Jojen and Meera Reed. Arya, Gendry, and Hot Pie meet the Brotherhood. Jamie travels through the wilderness with Brienne. Sansa confesses her true feelings about Joffery to Margaery.", "episode_url": "http://www.imdb.com/title/tt2178772/", "episode_number": 2, "season_number": 3, "episode_name": "Dark Wings, Dark Words"}, {"episode_rating": 8.8, "episode_summary": "Robb and Catelyn arrive at Riverrun for Lord Hoster Tully's funeral. Tywin names Tyrion the new Master of Coin. Arya says goodbye to Hot Pie. The Night's Watch returns to Craster's. Brianne and Jamie are taken prisoner.", "episode_url": "http://www.imdb.com/title/tt2178802/", "episode_number": 3, "season_number": 3, "episode_name": "Walk of Punishment"}, {"episode_rating": 9.5, "episode_summary": "Jamie mopes over his lost hand. Cersei is growing uncomfortable with the Tyrells. The Night's Watch is growing impatient with Caster. Daenerys buys the Unsullied.", "episode_url": "http://www.imdb.com/title/tt2178798/", "episode_number": 4, "season_number": 3, "episode_name": "And Now His Watch Is Ended"}, {"episode_rating": 8.9, "episode_summary": "Robb's army is falling apart. Jamie reveals a story, to Brienne, that he has never told anyone. Jon breaks his vows. The Hound is granted his freedom. The Lannisters hatch a new plan.", "episode_url": "http://www.imdb.com/title/tt2178788/", "episode_number": 5, "season_number": 3, "episode_name": "Kissed by Fire"}, {"episode_rating": 8.6, "episode_summary": "Jon and the wildlings scale The Wall. The Brotherhood sells Gendry to Melisandre. Robb does what he can to win back the Freys. Tyrion tells Sansa about their engagement.", "episode_url": "http://www.imdb.com/title/tt2178812/", "episode_number": 6, "season_number": 3, "episode_name": "The Climb"}, {"episode_rating": 8.5, "episode_summary": "Jon and the wildlings travel south of The Wall. Talisa tells Robb that she's pregnant. Arya runs away from the Brotherhood. Daenerys arrives at Yunkai. Jamie leaves Brienne behind at Harrenhal.", "episode_url": "http://www.imdb.com/title/tt2178814/", "episode_number": 7, "season_number": 3, "episode_name": "The Bear and the Maiden Fair"}, {"episode_rating": 8.9, "episode_summary": "Daenerys tries to persuade the Second Sons to join her against Yunkai. Stannis releases Davos from the dungeons. Sam and Gilly are attacked by a White Walker. Sansa and Tyrion wed.", "episode_url": "http://www.imdb.com/title/tt2178806/", "episode_number": 8, "season_number": 3, "episode_name": "Second Sons"}, {"episode_rating": 9.9, "episode_summary": "Robb and Catelyn arrive at the Twins for the wedding. Jon is put to the test to see where his loyalties truly lie. Bran's group decides to split up. Daenerys plans an invasion of Yunkai.", "episode_url": "http://www.imdb.com/title/tt2178784/", "episode_number": 9, "season_number": 3, "episode_name": "The Rains of Castamere"}, {"episode_rating": 9.0, "episode_summary": "Bran and company travel beyond The Wall. Sam returns to Castle Black. Jon says good bye to Ygritte. Jamie returns to King's Landing. The Night's Watch asks for help from Stannis.", "episode_url": "http://www.imdb.com/title/tt2178796/", "episode_number": 10, "season_number": 3, "episode_name": "Mhysa"}]