[{"episode_summary": "Liverpudlian caretaker Dave Lister is sentenced to 18-months in suspended animation for smuggling his pregnant cat Frankenstine on-board. But Dave awakes from Suspended animation, only to ...", "episode_name": "The End", "episode_number": 1, "season_number": 1, "episode_rating": 8.2, "episode_url": "http://www.imdb.com/title/tt0684181/"}, {"episode_summary": "Holly navigates Red Dwarf during light speed. But when Red Dwarf goes through light speed 24-hours early, the crew witnesses strange events and they find they are witnessing \"Future Echoes\" images of events that will happen in the future.", "episode_name": "Future Echoes", "episode_number": 2, "season_number": 1, "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt0684157/"}, {"episode_summary": "Lister wants to go on a date with the hologram of navigation officer Kristine Kochanski, much to Rimmer's disapproval. Lister decides to do a cooking exam so he can outrank Rimmer. But Rimmer has a cunning plan.", "episode_name": "Balance of Power", "episode_number": 3, "season_number": 1, "episode_rating": 8.0, "episode_url": "http://www.imdb.com/title/tt0684145/"}, {"episode_summary": "Lister learns he is the mythical god of Cat's people known as \"Cloister the stupid\" and Red Dwarf stumbles upon a Red Dwarf garbage capsule and Rimmer thinks it's a stasis capsule carrying a dormant alien woman.", "episode_name": "Waiting for God", "episode_number": 4, "season_number": 1, "episode_rating": 7.9, "episode_url": "http://www.imdb.com/title/tt0684186/"}, {"episode_summary": "Lister falls ill after entering a contaminated area of Red Dwarf trying to find Kochanski's hologram disc which Rimmer has hidden. But Red Dwarf has two unwelcome guests on-board, Lister's Confidence and Paranoia.", "episode_name": "Confidence & Paranoia", "episode_number": 5, "season_number": 1, "episode_rating": 8.1, "episode_url": "http://www.imdb.com/title/tt0684151/"}, {"episode_summary": "Rimmer moves into his new sleeping quarters with his holographic duplicate. Lister watches Rimmer's video containing footage of Rimmer's death, the two Rimmers start getting into a fight ...", "episode_name": "Me²", "episode_number": 6, "season_number": 1, "episode_rating": 8.2, "episode_url": "http://www.imdb.com/title/tt0684165/"}, {"episode_summary": "The crew discover the pristine,empty spaceship Trojan and use it to travel to the aid of Columbus III,to answer a distress call from Rimmer's brother Howard,who used to bully him. However ...", "episode_name": "Trojan", "episode_number": 1, "season_number": 10, "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt1997038/"}, {"episode_summary": "Whilst Lister writes himself a father's day card the others give Pree,the ship's computer,a glamorous upgrade. However she is soon putting the ship in danger and setting it on a collision ...", "episode_name": "Fathers & Suns", "episode_number": 2, "season_number": 10, "episode_rating": 8.2, "episode_url": "http://www.imdb.com/title/tt1999714/"}, {"episode_summary": "Whilst attempting to construct a Swedish flat-pack rejuvenation shower the crew accidentally transport themselves back to the year A.D. 23. In order to power their returner remote they need...", "episode_name": "Lemons", "episode_number": 3, "season_number": 10, "episode_rating": 8.2, "episode_url": "http://www.imdb.com/title/tt1999715/"}, {"episode_summary": "Whilst Cat and Kryten find themselves doing everything in unison due to 'quantum entanglement' Lister loses the shuttle craft 'Starbug' and Rimmer to a group of hairy genetically engineered...", "episode_name": "Entangled", "episode_number": 4, "season_number": 10, "episode_rating": 7.7, "episode_url": "http://www.imdb.com/title/tt1999716/"}, {"episode_summary": "Lister finds himself in a bizarre love triangle with two talking vending machines - sweet-voiced coffee maker number 23 and the more vengeful chocolate bar dispenser number 34 and ends up ...", "episode_name": "Dear Dave", "episode_number": 5, "season_number": 10, "episode_rating": 7.9, "episode_url": "http://www.imdb.com/title/tt1999717/"}, {"episode_summary": "The Red Dwarf is surrounded by hostile Annihilators and a Simulant death ship,with only two forks and a pencil sharpener for weapons. The crew flee in the shuttle and hide in an asteroid ...", "episode_name": "The Beginning", "episode_number": 6, "season_number": 10, "episode_rating": 8.2, "episode_url": "http://www.imdb.com/title/tt1999718/"}, {"episode_summary": "The Red Dwarf crew intercepts a SOS distress call from the American Space cruiser \"Nova 5\", that has crashed on a moon. They find the only survivor is Kryten, an android butler, whose favorite TV show is 'Androids'.", "episode_name": "Kryten", "episode_number": 1, "season_number": 2, "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0684161/"}, {"episode_summary": "A post pod carrying a 3 million year old bag of mail arrives and Rimmer becomes depressed when he learns his father is dead. The crew play an artificial game called \"Better than life\" which...", "episode_name": "Better Than Life", "episode_number": 2, "season_number": 2, "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt0684146/"}, {"episode_summary": "The Red Dwarf crew wake up four days after celebrating the anniversary of Rimmer's death, only to find they've got no memories of the previous four days, but when they find the black box on...", "episode_name": "Thanks for the Memory", "episode_number": 3, "season_number": 2, "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt0684180/"}, {"episode_summary": "Rimmer, Lister and Cat find a time barrier called \"Stasis Leak\" on Floor 16 and it takes them back in time on Red Dwarf 3 million years earlier. Rimmer and Lister try to change the past, ...", "episode_name": "Stasis Leak", "episode_number": 4, "season_number": 2, "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0684177/"}, {"episode_summary": "Red Dwarf's back-up computer Queeg 500 takes command of Red Dwarf when Holly allows a meteorite to damage the ship and Rimmer to malfunction. The crew encourages Holly to challenge Queeg to...", "episode_name": "Queeg", "episode_number": 5, "season_number": 2, "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt0684175/"}, {"episode_summary": "Holly creates a new star drive called \"Holly Hop Drive\" that will warp Red Dwarf from one part of space to another within a matter of seconds. It all goes wrong when Red Dwarf enters a ...", "episode_name": "Parallel Universe", "episode_number": 6, "season_number": 2, "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0684169/"}, {"episode_summary": "As Rimmer is taking Kryten for a driving lesson in Starbug they find themselves being whisked away through a time hole and end up on Earth, where time is running backwards.", "episode_name": "Backwards", "episode_number": 1, "season_number": 3, "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0684144/"}, {"episode_summary": "The Red Dwarf crew abandons ship as Red Dwarf approaches black holes. Rimmer and Lister find themselves marooned on a ice planet, when Starbug is struck by a meteorite, where the only ...", "episode_name": "Marooned", "episode_number": 2, "season_number": 3, "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0767232/"}, {"episode_summary": "The Red Dwarf crew encounter the Polymorph, a genetically engineered space mutant that drains the emotions from humans, that has arrived on-board Red Dwarf.", "episode_name": "Polymorph", "episode_number": 3, "season_number": 3, "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0684172/"}, {"episode_summary": "Red Dwarf becomes a booby-trap when Lister activates the self-destruct, which turns out to be the vending machine and Lister is implanted with the mind of one of the dead crew members and ...", "episode_name": "Bodyswap", "episode_number": 4, "season_number": 3, "episode_rating": 8.2, "episode_url": "http://www.imdb.com/title/tt0684148/"}, {"episode_summary": "The developing fluid that Krytern uses to process old photographs mutates and the photographs come alive. The Red Dwarf crew find they can go into the photograph, and Lister finds that the ...", "episode_name": "Timeslides", "episode_number": 5, "season_number": 3, "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt0684185/"}, {"episode_summary": "Lister receives a message from Jim Repear, head of Diva-Droid international, the company that created Kryten. Where they learn Kryten is to be dismantled within 24 hours and replaced by ...", "episode_name": "The Last Day", "episode_number": 6, "season_number": 3, "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0684183/"}, {"episode_summary": "Rimmer and Kryten rescue Camille, a female android from a passenger ship that has crash landed. Kryten falls in love with Camille, only to learn Camille is not who she appears to be, and ...", "episode_name": "Camille", "episode_number": 1, "season_number": 4, "episode_rating": 8.0, "episode_url": "http://www.imdb.com/title/tt0684149/"}, {"episode_summary": "The Red Dwarf crew investigates a alien spaceship that is drifting in deep space. Where they discover a D.N.A modifier, a genetic altering machine that alters all organic life. But all ...", "episode_name": "D.N.A.", "episode_number": 2, "season_number": 4, "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt0684152/"}, {"episode_summary": "The Red Dwarf crew transport a defrosting stasis capsule to 'Justice World', a remote penal space station, where they believe the person in the capsule maybe one of the convicts or one of ...", "episode_name": "Justice", "episode_number": 3, "season_number": 4, "episode_rating": 8.6, "episode_url": "http://www.imdb.com/title/tt0684160/"}, {"episode_summary": "The Red Dwarf crew set out to restore Holly's IQ with the use of Talkie-Toaster, who Lister dismantled because Talkie-Talk winds him up with his obsession of serving toast. But something ...", "episode_name": "White Hole", "episode_number": 4, "season_number": 4, "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0684187/"}, {"episode_summary": "Arnold \"Ace\" Rimmer is a daredevil test pilot for the space corps, and he has been assigned to test-pilot a ship that can travel through dimensions, so he can meet many different versions ...", "episode_name": "Dimension Jump", "episode_number": 5, "season_number": 4, "episode_rating": 8.8, "episode_url": "http://www.imdb.com/title/tt0684153/"}, {"episode_summary": "The Red Dwarf crew travels to \"Waxworld\" an android theme park, when Kryten discovers a matter transmission device. Lister and Cat are taken prisoner by Adolf Hitler, whilst Rimmer and ...", "episode_name": "Meltdown", "episode_number": 6, "season_number": 4, "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0684164/"}, {"episode_summary": "Rimmer is abducted by the holographic crew of a Holographic space vessel, and he finds the vessel is perfect and the holographic crew members have super intelligence and Rimmer decides to ...", "episode_name": "Holoship", "episode_number": 1, "season_number": 5, "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0684159/"}, {"episode_summary": "The Inquistor, a cybernetic judge, jury and executioner travels through time, erasing worthless losers who have wasted their lives out of existence. The Red Dwarf crew are the next to be ...", "episode_name": "The Inquisitor", "episode_number": 2, "season_number": 5, "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt0684182/"}, {"episode_summary": "Lister, Kryten, Cat and Holly head for a artificial moon, where Rimmer has been kidnapped, only to find the artificial moon is Rimmer's mind.", "episode_name": "Terrorform", "episode_number": 3, "season_number": 5, "episode_rating": 8.1, "episode_url": "http://www.imdb.com/title/tt0684179/"}, {"episode_summary": "After investigating a abandoned research complex on a ice planet. Lister, Cat and Kryten returns to Red Dwarf only to find Rimmer has been infected with a electronic virus and he has taken ...", "episode_name": "Quarantine", "episode_number": 4, "season_number": 5, "episode_rating": 8.9, "episode_url": "http://www.imdb.com/title/tt0684174/"}, {"episode_summary": "An experiment with a machine that can make duplicates of an object goes wrong and Red Dwarf explodes. Where the Red Dwarf crew find the machine has made two copies of Red Dwarf, both ships contains their good and evil selves.", "episode_name": "Demons & Angels", "episode_number": 5, "season_number": 5, "episode_rating": 8.4, "episode_url": "http://www.imdb.com/title/tt0756588/"}, {"episode_summary": "The Red Dwarf investigates an ocean ship, The Esperanto, where they find the ship's crew have all committed suicide and they are attacked by a sea monster called The Dispair squid. Only to ...", "episode_name": "Back to Reality", "episode_number": 6, "season_number": 5, "episode_rating": 9.1, "episode_url": "http://www.imdb.com/title/tt0684143/"}, {"episode_summary": "200 years after investigating the Esperato, the Red Dwarf crew awakes from suspended animation, as they set out to find Red Dwarf, which has vanished without a trace, on-board Starbug. ...", "episode_name": "Psirens", "episode_number": 1, "season_number": 6, "episode_rating": 8.2, "episode_url": "http://www.imdb.com/title/tt0684173/"}, {"episode_summary": "Starbug is taken over by a tractor beam which takes them to a deep space space station, where the crew discover Legion, a life form conceived from a experiment by famous scientists. Only to...", "episode_name": "Legion", "episode_number": 2, "season_number": 6, "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt0684163/"}, {"episode_summary": "Starbug stumbles upon a battleship carrying on-board murderous cyborgs called \"Simulants\". When the \"Simulants\" infect Starbug with a virus and Starbug heads on a collision course with a ...", "episode_name": "Gunmen of the Apocalypse", "episode_number": 3, "season_number": 6, "episode_rating": 8.7, "episode_url": "http://www.imdb.com/title/tt0684158/"}, {"episode_summary": "Starbug is attacked by a Space Corp enforcement probe, for looting from derelict ships. Starbug crash lands on a Gelf moon, where Lister must marry the Gelf leader's daughter in exchange ...", "episode_name": "Emohawk: Polymorph II", "episode_number": 4, "season_number": 6, "episode_rating": 8.1, "episode_url": "http://www.imdb.com/title/tt0684155/"}, {"episode_summary": "The Starbug crew returns to the Simulant's battleship to salvage for food-supplies. But Rimmer, who has been diagnosed of a tense nervous disorder, escapes on-board a escape pod which has ...", "episode_name": "Rimmerworld", "episode_number": 5, "season_number": 6, "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0684176/"}, {"episode_summary": "Starbug enters a fog in space containing devices that create false realities, where the crew find a time machine, where they meet themselves 15 years in the future and engage in a space ...", "episode_name": "Out of Time", "episode_number": 6, "season_number": 6, "episode_rating": 8.5, "episode_url": "http://www.imdb.com/title/tt0756589/"}, {"episode_summary": "In the aftermath of the battle with their future selves, the crew, resurrected from the dead, due to time paradoxes and Lister is depressed when he learns the curry supplies were destroyed ...", "episode_name": "Tikka to Ride", "episode_number": 1, "season_number": 7, "episode_rating": 8.1, "episode_url": "http://www.imdb.com/title/tt0684184/"}, {"episode_summary": "Daredevil pilot Ace Rimmer, seriously wounded, after rescuing Princess Bonjella from the Nazis, arrives on-board Starbug, to recruit Rimmer to take his place as the next Ace Rimmer. Will Rimmer continue the legacy of Ace Rimmer?", "episode_name": "Stoke Me a Clipper", "episode_number": 2, "season_number": 7, "episode_rating": 8.3, "episode_url": "http://www.imdb.com/title/tt0684178/"}, {"episode_summary": "Lister, Cat and Krytern stumble upon a doorway that leads to another dimension. Where Lister learns he died in the nuclear disaster on-board Red Dwarf and has been brought back as a ...", "episode_name": "Ouroboros", "episode_number": 3, "season_number": 7, "episode_rating": 7.4, "episode_url": "http://www.imdb.com/title/tt0684168/"}, {"episode_summary": "Kryten thinks Lister likes Konchanski better than him and is making a fuss about it. When the primary power goes off and they all get stuck in a room they have no choice but to climb into ...", "episode_name": "Duct Soup", "episode_number": 4, "season_number": 7, "episode_rating": 7.1, "episode_url": "http://www.imdb.com/title/tt0684154/"}, {"episode_summary": "Lister, missing Rimmer, tries to recall the good times they had together, and fantasizes about Rimmer's return (which leads to Lister's hottest kiss yet). Meanwhile, Kryten's rivalry with ...", "episode_name": "Blue", "episode_number": 5, "season_number": 7, "episode_rating": 7.6, "episode_url": "http://www.imdb.com/title/tt0756587/"}, {"episode_summary": "Searching for a new head for Kryten (which exploded due to an incident involving ketchup and lobster), the crew encounter a rogue simulant on a deserted ship. The simulant kidnaps Kryten ...", "episode_name": "Beyond a Joke", "episode_number": 6, "season_number": 7, "episode_rating": 7.3, "episode_url": "http://www.imdb.com/title/tt0684147/"}, {"episode_summary": "The crew come across an abandoned ship with one survivor: Caroline Carmen, one of Lister's former crushes. She revives in the middle of the night and infects Lister with the dreaded Epideme...", "episode_name": "Epideme", "episode_number": 7, "season_number": 7, "episode_rating": 7.5, "episode_url": "http://www.imdb.com/title/tt0684156/"}, {"episode_summary": "As Lister tries to cope with the loss of his arm, Kryten searches for his nanobots (microscopic robots) to get them to rebuild the arm. In Lister's laundry basket, he finds out who stole ...", "episode_name": "Nanarchy", "episode_number": 8, "season_number": 7, "episode_rating": 7.5, "episode_url": "http://www.imdb.com/title/tt0684166/"}, {"episode_summary": "The Nano Bots have rebuilt Red Dwarf and Lister, Kochansi, Kryten and Cat find that the Nano Bots have not only rebuilt the ship, the Nano Bots have resurrected the crew and they find ...", "episode_name": "Back in the Red: Part 1", "episode_number": 1, "season_number": 8, "episode_rating": 7.8, "episode_url": "http://www.imdb.com/title/tt0684140/"}, {"episode_summary": "After discovering the luck virus and the confidential reports in Starbugs wreckage, Rimmer begins his scheme to get promoted, and he begins to impress Captain Hoillister and the sexual ...", "episode_name": "Back in the Red: Part 2", "episode_number": 2, "season_number": 8, "episode_rating": 7.8, "episode_url": "http://www.imdb.com/title/tt0684141/"}, {"episode_summary": "Lister, Kochanski, Kryten, Cat and Holly escapes on board Blue Midget and they begin their search for the Nano Bots. Rimmer discovers Lister, Kochanski, Kryten, Cat and Holly are in a ...", "episode_name": "Back in the Red: Part 3", "episode_number": 3, "season_number": 8, "episode_rating": 7.6, "episode_url": "http://www.imdb.com/title/tt0684142/"}, {"episode_summary": "Sentenced to 2 years for stealing the confidential reports in 'The Tank' on Floor 13. Lister signs up for the 'Canaries', unaware the 'Canaries' is a convict army and he has also signed up ...", "episode_name": "Cassandra", "episode_number": 4, "season_number": 8, "episode_rating": 8.0, "episode_url": "http://www.imdb.com/title/tt0684150/"}, {"episode_summary": "Kill Crazy reprograms Kryten, and Kryten puts on \"Krytie TV\" a pirate entertain show for the convicts, where Kryten goes into the women's shower room and exposes the naked bodies of the ...", "episode_name": "Krytie TV", "episode_number": 5, "season_number": 8, "episode_rating": 7.8, "episode_url": "http://www.imdb.com/title/tt0684162/"}, {"episode_summary": "After playing a practical joke on Warden Ackerman, Lister and Rimmer along with Kochanski, Kryten and the Cat are forced to take on the guards led by Warden Ackerman in a game of basketball...", "episode_name": "Pete: Part 1", "episode_number": 6, "season_number": 8, "episode_rating": 7.0, "episode_url": "http://www.imdb.com/title/tt0684170/"}, {"episode_summary": "Kryten has accidentally turned Birdman's pet bird \"Pete\" into a T-Rex which has gone on a rampage on-board Red Dwarf. With the crew frozen in time, Rimmer, Lister, Kryten, Kochanski, The ...", "episode_name": "Pete: Part 2", "episode_number": 7, "season_number": 8, "episode_rating": 6.8, "episode_url": "http://www.imdb.com/title/tt0684171/"}, {"episode_summary": "A escape pod containing a \"Microbe\" a genetically-engineered virus that eats metal and programmed not to harm glass has arrived on-board \"Red Dwarf\" and begins to eat away Red Dwarf. Left ...", "episode_name": "Only the Good...", "episode_number": 8, "season_number": 8, "episode_rating": 7.5, "episode_url": "http://www.imdb.com/title/tt0684167/"}, {"episode_summary": "Life has not been the same since the nanabots re-created Red Dwarf, and now Lister and Rimmer are forced to take on the guards in a basketball game. The only way they believe they have a ...", "episode_name": "Back to Earth (Part One)", "episode_number": 1, "season_number": 9, "episode_rating": 6.5, "episode_url": "http://www.imdb.com/title/tt1365540/"}, {"episode_summary": "Rimmer's replacement, Katerina, is determined to guide Lister back to his home planet. But Earth in 2009 is not everything the boys had expected, and Rimmer has no intention of being replaced.", "episode_name": "Back to Earth (Part Two)", "episode_number": 2, "season_number": 9, "episode_rating": 6.5, "episode_url": "http://www.imdb.com/title/tt1371606/"}, {"episode_summary": "Go behind the scenes of Red Dwarf: Back to Earth in this making of special featuring interviews with the cast and crew.", "episode_name": "Back to Earth (Part Three)", "episode_number": 3, "season_number": 9, "episode_rating": 6.8, "episode_url": "http://www.imdb.com/title/tt1400975/"}]