[{"episode_number": 0, "episode_name": "Pilot", "episode_summary": "A young F.B.I. agent is assigned watchdog duty over a fellow agent, but finds herself drawn into his investigations of paranormal and unexplained phenomena.", "episode_url": "http://www.imdb.com/title/tt0170817/", "episode_rating": 8.2, "season_number": 1}, {"episode_number": 1, "episode_name": "Deep Throat", "episode_summary": "Agents Mulder and Scully investigate the suspicious behaviour of a secret air force base in Idaho, coming into contact with government forces which threaten their careers and safety.", "episode_url": "http://www.imdb.com/title/tt0751099/", "episode_rating": 8.3, "season_number": 1}, {"episode_number": 2, "episode_name": "Squeeze", "episode_summary": "Scully and Mulder are called in when a businessman is found dead in his office. The doors and windows were locked from the inside and the only other possible opening is an extraordinarily ...", "episode_url": "http://www.imdb.com/title/tt0751208/", "episode_rating": 8.7, "season_number": 1}, {"episode_number": 3, "episode_name": "Conduit", "episode_summary": "Mulder and Scully travel to Sioux City to investigate the disappearance of a teenager, Ruby Morris, whose mother Darlene claims was abducted by aliens. There's some reluctance on the part ...", "episode_url": "http://www.imdb.com/title/tt0751094/", "episode_rating": 7.7, "season_number": 1}, {"episode_number": 4, "episode_name": "The Jersey Devil", "episode_summary": "When a homeless man is found in the woods just outside Atlantic City with his arm and shoulder chewed off, Mulder thinks it may be the work of the fabled Jersey Devil. Mulder has an X file ...", "episode_url": "http://www.imdb.com/title/tt0751229/", "episode_rating": 7.1, "season_number": 1}, {"episode_number": 5, "episode_name": "Shadows", "episode_summary": "Scully and Mulder are called in by two secretive government agents and asked if they've ever had an X file with similarities to their most recent case. Two men were found dead in an alley ...", "episode_url": "http://www.imdb.com/title/tt0751201/", "episode_rating": 7.3, "season_number": 1}, {"episode_number": 6, "episode_name": "Ghost in the Machine", "episode_summary": "Mulder and Scully are asked by Mulder's old partner Agent Jerry Lamana for help on a case. Benjamin Drake chairman of Eurisko, a major computer company, was electrocuted at the office. The ...", "episode_url": "http://www.imdb.com/title/tt0751131/", "episode_rating": 6.8, "season_number": 1}, {"episode_number": 7, "episode_name": "Ice", "episode_summary": "Mulder, Scully and 3 scientists travel to the arctic to investigate what happened to the previous team of scientists sent there, and discover what they believe is a new life-form that makes its host want to kill other people.", "episode_url": "http://www.imdb.com/title/tt0751141/", "episode_rating": 8.9, "season_number": 1}, {"episode_number": 8, "episode_name": "Space", "episode_summary": "Mulder and Scully travel to Houston after a NASA employee, Michelle Generoo, shows them evidence that a space shuttle may have been sabotaged. They had recently had to abort a launch just ...", "episode_url": "http://www.imdb.com/title/tt0751207/", "episode_rating": 6.1, "season_number": 1}, {"episode_number": 9, "episode_name": "Fallen Angel", "episode_summary": "With inside information courtesy of Deep Throat, Mulder heads off to Wisconsin where the Defense Department is in the process of reclaiming a downed UFO. He sets off on his own and finds ...", "episode_url": "http://www.imdb.com/title/tt0751120/", "episode_rating": 8.0, "season_number": 1}, {"episode_number": 10, "episode_name": "Eve", "episode_summary": "Scully and Mulder are called into investigate a strange case of a man found sitting in his backyard having been exsanguinated and having two bite marks on his neck. The man's daughter, ...", "episode_url": "http://www.imdb.com/title/tt0751116/", "episode_rating": 8.2, "season_number": 1}, {"episode_number": 11, "episode_name": "Fire", "episode_summary": "Mulder is approached by a former love interest, Scotland Yard Inspector Phoebe Green, who needs help on a case. To date, three British politicians have spontaneously combusted, burning to a...", "episode_url": "http://www.imdb.com/title/tt0751124/", "episode_rating": 7.4, "season_number": 1}, {"episode_number": 12, "episode_name": "Beyond the Sea", "episode_summary": "After two college students are kidnapped on the one year anniversary of a similar kidnapping at a different school, Mulder is convinced that they are dealing with a serial killer. He's ...", "episode_url": "http://www.imdb.com/title/tt0751083/", "episode_rating": 8.7, "season_number": 1}, {"episode_number": 13, "episode_name": "Gender Bender", "episode_summary": "Mulder and Scully investigate a series of bizarre deaths, all of which involved healthy young adults who died of massive coronaries after having sexual intercourse. Mulder believes the ...", "episode_url": "http://www.imdb.com/title/tt0751129/", "episode_rating": 7.5, "season_number": 1}, {"episode_number": 14, "episode_name": "Lazarus", "episode_summary": "Scully and another agent, Jack Willis, are on a stakeout in a bank that they believe has been targeted by a pair of married robbers. In the ensuing gunfire, both the robber and Agent Willis...", "episode_url": "http://www.imdb.com/title/tt0751152/", "episode_rating": 7.1, "season_number": 1}, {"episode_number": 15, "episode_name": "Young at Heart", "episode_summary": "John Barnett, Mulder's first Bureau case and seemingly dead killer, is back in action. Reclaiming his affection for cryptic messages as well as his taunting personality, he leads Mulder and...", "episode_url": "http://www.imdb.com/title/tt0751265/", "episode_rating": 7.4, "season_number": 1}, {"episode_number": 16, "episode_name": "E.B.E.", "episode_summary": "Scully and Mulder investigate a possible encounter between a trucker and a UFO in Tennessee. For Mulder the evidence of a close encounter is overwhelming. With information from Deep Throat,...", "episode_url": "http://www.imdb.com/title/tt0751108/", "episode_rating": 8.6, "season_number": 1}, {"episode_number": 17, "episode_name": "Miracle Man", "episode_summary": "The FBI is called in to assist Sheriff Maurice Daniels who thinks that a young preacher, Samuel Hartley, is responsible for several deaths. Since he was a young child Hartley has reputedly ...", "episode_url": "http://www.imdb.com/title/tt0751162/", "episode_rating": 7.1, "season_number": 1}, {"episode_number": 18, "episode_name": "Shapes", "episode_summary": "A Montana Native American reserve is the center of attention as Mulder and Scully investigate the strange death of a local Indian man. The shooters claim they saw a monster attack them, and...", "episode_url": "http://www.imdb.com/title/tt0751202/", "episode_rating": 7.0, "season_number": 1}, {"episode_number": 19, "episode_name": "Darkness Falls", "episode_summary": "Mulder and Scully head off to the Pacific Northwest when there are reports that 30 loggers seem to have simply disappeared. Mulder is aware of a similar case for the 1930s and along with a ...", "episode_url": "http://www.imdb.com/title/tt0751097/", "episode_rating": 8.6, "season_number": 1}, {"episode_number": 20, "episode_name": "Tooms", "episode_summary": "In this sequel to \"Squeeze\", Tooms is released after an investigation. However, he needs to be stopped before he can claim his last victim and go into hibernation for another 30 years.", "episode_url": "http://www.imdb.com/title/tt0751246/", "episode_rating": 8.3, "season_number": 1}, {"episode_number": 21, "episode_name": "Born Again", "episode_summary": "Mulder and Scully are called in by the Buffalo Police Department after an experienced detective, Rudy Barbala, jumped to his death through a window from the upper floor of the 14th precinct...", "episode_url": "http://www.imdb.com/title/tt0751086/", "episode_rating": 7.2, "season_number": 1}, {"episode_number": 22, "episode_name": "Roland", "episode_summary": "Mulder and Scully are called in to investigate the murder of a jet propulsion scientist who was trapped in a wind chamber and sucked through a jet engine when the unit was activated. It ...", "episode_url": "http://www.imdb.com/title/tt0751193/", "episode_rating": 7.3, "season_number": 1}, {"episode_number": 23, "episode_name": "The Erlenmeyer Flask", "episode_summary": "Deep Throat contacts Mulder in the middle of the night to give him some important information. A man successfully evaded police when at the end of a high speed chase, he jumps into the ...", "episode_url": "http://www.imdb.com/title/tt0751224/", "episode_rating": 9.0, "season_number": 1}, {"episode_number": 1, "episode_name": "Little Green Men", "episode_summary": "With his main informant dead and the X Files shut down, Mulder finds himself reassigned to regular FBI duties. He is convinced he's being followed and his conversations listened in on. ...", "episode_url": "http://www.imdb.com/title/tt0751154/", "episode_rating": 8.2, "season_number": 2}, {"episode_number": 2, "episode_name": "The Host", "episode_summary": "With the X Files still shut down, Mulder is re-assigned from wiretap monitoring to a murder investigation. He finds himself in the sewers of New Jersey and assumes that Assistant Director ...", "episode_url": "http://www.imdb.com/title/tt0751228/", "episode_rating": 8.3, "season_number": 2}, {"episode_number": 3, "episode_name": "Blood", "episode_summary": "FBI agent Fox Mulder is called in by a small-town sheriff to investigate a raft of inexplicable killings. The acts are random and committed by well-respected members of the community. ...", "episode_url": "http://www.imdb.com/title/tt0751085/", "episode_rating": 7.7, "season_number": 2}, {"episode_number": 4, "episode_name": "Sleepless", "episode_summary": "Mulder is partnered with a young FBI agent, Alex Krycek, in the investigation of mysterious deaths. An apartment dweller called emergency services to report a fire outside his door but ...", "episode_url": "http://www.imdb.com/title/tt0751204/", "episode_rating": 7.9, "season_number": 2}, {"episode_number": 5, "episode_name": "Duane Barry", "episode_summary": "Mulder is called in to act as a hostage negotiator when a mentally unbalanced convict, Duane Barry, takes four people prisoner. Dwayne believes he's a alien abductee and he believes aliens ...", "episode_url": "http://www.imdb.com/title/tt0751107/", "episode_rating": 8.8, "season_number": 2}, {"episode_number": 6, "episode_name": "Ascension", "episode_summary": "Mulder sets out with agent Alex Krycek to find Scully, who has been kidnapped by Duane Barry. He's getting very little support from his superiors, including Assistant Director Skinner who ...", "episode_url": "http://www.imdb.com/title/tt0751077/", "episode_rating": 8.8, "season_number": 2}, {"episode_number": 7, "episode_name": "3", "episode_summary": "Whilst Agent Scully is still missing, Agent Mulder embarks upon an investigation involving vampires in Los Angeles, subsequently becoming involved with a sultry female vampire who yearns to escape her lifestyle.", "episode_url": "http://www.imdb.com/title/tt0751066/", "episode_rating": 6.6, "season_number": 2}, {"episode_number": 8, "episode_name": "One Breath", "episode_summary": "Everyone, including Mulder and Scully's mother, had pretty well given Scully up for dead when she suddenly reappears at a Washington hospital. Details are scanty - the hospital can't really...", "episode_url": "http://www.imdb.com/title/tt0751169/", "episode_rating": 8.6, "season_number": 2}, {"episode_number": 9, "episode_name": "Firewalker", "episode_summary": "Mulder and Scully investigate strange occurrences at a volcano site where at least one scientist has died. A robotic video showed the scientist lying dead at the bottom of a crater where ...", "episode_url": "http://www.imdb.com/title/tt0751125/", "episode_rating": 7.3, "season_number": 2}, {"episode_number": 10, "episode_name": "Red Museum", "episode_summary": "Agents Mulder and Scully investigate when a religious cult is accused of kidnapping, branding their victims with the words 'He is One', or 'She is One'.", "episode_url": "http://www.imdb.com/title/tt0751185/", "episode_rating": 7.8, "season_number": 2}, {"episode_number": 11, "episode_name": "Excelsis Dei", "episode_summary": "Mulder and Scully investigate the case of a woman, a nurse in an elder care facility, who claims she was raped at the facility by an invisible spirit. Nurse Michelle Charters has the ...", "episode_url": "http://www.imdb.com/title/tt0751117/", "episode_rating": 7.1, "season_number": 2}, {"episode_number": 12, "episode_name": "Aubrey", "episode_summary": "Mulder and Scully are called in by a local field office when the body of a long dead FBI agent is found by a local police detective in Aubrey, Missouri. The dead FBI agent died in 1942 but ...", "episode_url": "http://www.imdb.com/title/tt0751078/", "episode_rating": 7.6, "season_number": 2}, {"episode_number": 13, "episode_name": "Irresistible", "episode_summary": "Mulder and Scully are in Minneapolis on the trail of a serial killer who likes to collect trophies from his victims. The killer is Donald Addie Pfaster, who goes by Donnie. He likes young ...", "episode_url": "http://www.imdb.com/title/tt0751144/", "episode_rating": 8.2, "season_number": 2}, {"episode_number": 14, "episode_name": "Die Hand die verletzt", "episode_summary": "Scully and Mulder are called in by a local New Hampshire Sheriff when there is evidence of a satanic cult operating in his town. One teen has already died and paranoia has now gripped ...", "episode_url": "http://www.imdb.com/title/tt0751102/", "episode_rating": 8.2, "season_number": 2}, {"episode_number": 15, "episode_name": "Fresh Bones", "episode_summary": "Scully and Mulder investigate the death of a soldier working at a Haitian refugee camp. He drove his car into a tree and his death has been ruled a suicide but the man's wife simply doesn't...", "episode_url": "http://www.imdb.com/title/tt0751128/", "episode_rating": 7.2, "season_number": 2}, {"episode_number": 16, "episode_name": "Colony", "episode_summary": "Mulder and Scully decide to investigate when they anonymously receive three newspaper obituaries for three men who appear to be identical. All of them worked in abortion clinics and they ...", "episode_url": "http://www.imdb.com/title/tt0751093/", "episode_rating": 8.9, "season_number": 2}, {"episode_number": 17, "episode_name": "End Game", "episode_summary": "Samantha tells her brother about the shape-shifting Alien Bounty Hunter and why he is out to kill all of them. With Scully taken prisoner by the Alien Bounty Hunter, Mulder arranges to swap...", "episode_url": "http://www.imdb.com/title/tt0751114/", "episode_rating": 8.9, "season_number": 2}, {"episode_number": 18, "episode_name": "Fearful Symmetry", "episode_summary": "Mulder and Scully investigate strange occurrences when an invisible forces seems to wreck the downtown of Fairfield, Idaho and an elephant from the local zoo is found lying on the highway ...", "episode_url": "http://www.imdb.com/title/tt0751121/", "episode_rating": 6.7, "season_number": 2}, {"episode_number": 19, "episode_name": "Død Kalm", "episode_summary": "When some people on a ship are rescued, it is discovered that they are aging and later, dying. Mulder takes it upon himself to investigate the ship, which he believes has been the target of Philadelphia Experiments.", "episode_url": "http://www.imdb.com/title/tt0751103/", "episode_rating": 7.8, "season_number": 2}, {"episode_number": 20, "episode_name": "Humbug", "episode_summary": "Mulder and Scully find themselves delving into the world of freaks and circus sideshows when Jerald Glazebrook, otherwise known as the Alligator Man, is killed in his swimming pool. Mulder ...", "episode_url": "http://www.imdb.com/title/tt0751139/", "episode_rating": 8.8, "season_number": 2}, {"episode_number": 21, "episode_name": "The Calusari", "episode_summary": "A two-year-old boy in a Virginia park is mysteriously killed, and a further look shows a ghostly figure luring him. Mulder and Scully investigate despite an existing official inquiry, and ...", "episode_url": "http://www.imdb.com/title/tt0751222/", "episode_rating": 7.5, "season_number": 2}, {"episode_number": 22, "episode_name": "F. Emasculata", "episode_summary": "When a package with infected contents releases the virus on its inmate recipient, a dozen prisoners contract it and Mulder and Scully are mysteriously called in to help. What they find ...", "episode_url": "http://www.imdb.com/title/tt0751119/", "episode_rating": 8.2, "season_number": 2}, {"episode_number": 23, "episode_name": "Soft Light", "episode_summary": "Three deaths have occurred around Richmond, Virginia. The only traces which each of the victims seem to have left behind are black scorch marks of unknown origin. Mulder and Scully are ...", "episode_url": "http://www.imdb.com/title/tt0751206/", "episode_rating": 7.9, "season_number": 2}, {"episode_number": 24, "episode_name": "Our Town", "episode_summary": "Reports of foxfire on a field in Dudley, Arkansas lead Mulder and Scully to a bizarre situation regarding the townsfolk. Employees of the Chaco Chicken Corporation are displaying bizarre behavior, and the death rate is slowly increasing.", "episode_url": "http://www.imdb.com/title/tt0751173/", "episode_rating": 8.0, "season_number": 2}, {"episode_number": 25, "episode_name": "Anasazi", "episode_summary": "A man known as \"The Thinker\" has hacked into the U.S. Department of Defense mainframe and uncovered 50-years-worth of proof that the Gov't has been dealing with aliens. Mulder and Scully ...", "episode_url": "http://www.imdb.com/title/tt0751074/", "episode_rating": 9.2, "season_number": 2}, {"episode_number": 1, "episode_name": "The Blessing Way", "episode_summary": "A furious pursuit of Agent Mulder is underway, and more importantly, the government wants the data tape he carried. Agent Scully, against all odds, searches to uncover his whereabouts, persisting that he is alive when all others deny it.", "episode_url": "http://www.imdb.com/title/tt0751221/", "episode_rating": 8.8, "season_number": 3}, {"episode_number": 2, "episode_name": "Paper Clip", "episode_summary": "Mulder returns to Skinner and Scully while the deadly pursuit is still at hand. Led by an old photograph of his father and a group of scientists, he and Scully discover more than they could...", "episode_url": "http://www.imdb.com/title/tt0751174/", "episode_rating": 9.0, "season_number": 3}, {"episode_number": 3, "episode_name": "D.P.O.", "episode_summary": "A local teen discovers he has gained great electrical powers after surviving being struck by lightning.", "episode_url": "http://www.imdb.com/title/tt0751095/", "episode_rating": 7.9, "season_number": 3}, {"episode_number": 4, "episode_name": "Clyde Bruckman's Final Repose", "episode_summary": "Scully and Mulder are called into the investigation of a series of murders where the victims were all psychics of some sort. A tea leaf reader, tarot card reader and palm reader are all the...", "episode_url": "http://www.imdb.com/title/tt0751092/", "episode_rating": 9.2, "season_number": 3}, {"episode_number": 5, "episode_name": "The List", "episode_summary": "After death row prisoner Napoleon \"Neech\" Manley is executed in Florida's electric chair, a number of prison guards are the victims of gruesome murders. Scully and Mulder are called into ...", "episode_url": "http://www.imdb.com/title/tt0751230/", "episode_rating": 7.2, "season_number": 3}, {"episode_number": 6, "episode_name": "2Shy", "episode_summary": "Shy, overweight women are being pursued online by a suitor who courts them with Italian poetry. The women are being found dead, their corpses stripped of flesh.", "episode_url": "http://www.imdb.com/title/tt0751065/", "episode_rating": 7.5, "season_number": 3}, {"episode_number": 7, "episode_name": "The Walk", "episode_summary": "Scully and Mulder investigate a series of accidents at a VA hospital in Virginia. Lt. Col. Victor Stans has tried several times to kill himself, but has always survived claiming, \"He won't ...", "episode_url": "http://www.imdb.com/title/tt0751240/", "episode_rating": 7.3, "season_number": 3}, {"episode_number": 8, "episode_name": "Oubliette", "episode_summary": "Scully and Mulder investigate the kidnapping of 15 year-old Amy Jacobs who was snatched from her bedroom in the middle of the night. Mulder is intrigued by the fact that at the same time ...", "episode_url": "http://www.imdb.com/title/tt0751172/", "episode_rating": 7.8, "season_number": 3}, {"episode_number": 9, "episode_name": "Nisei", "episode_summary": "After Mulder buys an alien autopsy video from a mail order house in Allentown, Pa. he thinks he may be onto the real thing. He goes to Allentown with a skeptical Scully to find that the man...", "episode_url": "http://www.imdb.com/title/tt0751166/", "episode_rating": 8.6, "season_number": 3}, {"episode_number": 10, "episode_name": "731", "episode_summary": "Now aboard the mysterious train, Mulder locates the car containing the scientific equipment and what appears to be the autopsy room he saw in the video he purchased. There is also an ...", "episode_url": "http://www.imdb.com/title/tt0751068/", "episode_rating": 8.8, "season_number": 3}, {"episode_number": 11, "episode_name": "Revelations", "episode_summary": "Scully and Mulder investigate the murder of a popular evangelist who claimed, falsely as it turns out, to bear the wounds Christ bore from the cross - stigmata. Mulder is aware that there ...", "episode_url": "http://www.imdb.com/title/tt0751191/", "episode_rating": 7.5, "season_number": 3}, {"episode_number": 12, "episode_name": "War of the Coprophages", "episode_summary": "Agent Mulder is out investigating reports of strange lights in the night sky when he learns from the local Sheriff that there is another death in town from killer cockroaches. Intrigued, ...", "episode_url": "http://www.imdb.com/title/tt0751259/", "episode_rating": 8.9, "season_number": 3}, {"episode_number": 13, "episode_name": "Syzygy", "episode_summary": "Scully and Mulder investigate a series deaths all involving boys from the same high school. The town is in a uproar and rumors of a satanic cult being responsible abound. Everyone in town ...", "episode_url": "http://www.imdb.com/title/tt0751212/", "episode_rating": 7.8, "season_number": 3}, {"episode_number": 14, "episode_name": "Grotesque", "episode_summary": "After a serial killer, who claims to have killed people under the influence of a demon, is arrested, the murders continue. Meanwhile Mulder, who believes that the demon might have picked someone new, goes neck-deep in the investigation.", "episode_url": "http://www.imdb.com/title/tt0751132/", "episode_rating": 7.6, "season_number": 3}, {"episode_number": 15, "episode_name": "Piper Maru", "episode_summary": "Scully and Mulder investigate the case of the crew of a French salvage ship who are all, with one exception, suffering from severe radiation burns. Mulder is particularly interested in the ...", "episode_url": "http://www.imdb.com/title/tt0751180/", "episode_rating": 8.6, "season_number": 3}, {"episode_number": 16, "episode_name": "Apocrypha", "episode_summary": "With Assistant Director Skinner in the hospital recovering from his gunshot wounds, Scully and Mulder pursue various leads. Scully meets with with a retired naval officer, a friend of her ...", "episode_url": "http://www.imdb.com/title/tt0751075/", "episode_rating": 8.7, "season_number": 3}, {"episode_number": 17, "episode_name": "Pusher", "episode_summary": "A seemingly unmotivated murderer, who can apparently talk his victims into killing themselves is on the loose and it is up to Mulder and Scully to study the clues left to them by the person and capture him.", "episode_url": "http://www.imdb.com/title/tt0751183/", "episode_rating": 8.6, "season_number": 3}, {"episode_number": 18, "episode_name": "Teso dos Bichos", "episode_summary": "At a South American dig, archaeologists unearth the grave of an ancient shaman. Transported to the Boston Museum of Natural History against the wishes of the locals, strange occurrences ...", "episode_url": "http://www.imdb.com/title/tt0751218/", "episode_rating": 6.0, "season_number": 3}, {"episode_number": 19, "episode_name": "Hell Money", "episode_summary": "Scully and Mulder investigate the murder of someone who was burned alive in a funeral parlor crematorium. The autopsy reveals that he was missing several vital organs - an eye, a kidney - ...", "episode_url": "http://www.imdb.com/title/tt0751133/", "episode_rating": 7.2, "season_number": 3}, {"episode_number": 20, "episode_name": "Jose Chung's 'From Outer Space'", "episode_summary": "Well known author Jose Chung is writing a book about the claimed alien abduction of a young couple that was subsequently investigated by agents Mulder and Scully. With Mulder unavailable, ...", "episode_url": "http://www.imdb.com/title/tt0751147/", "episode_rating": 9.0, "season_number": 3}, {"episode_number": 21, "episode_name": "Avatar", "episode_summary": "With his marriage on the rocks and on the verge of getting a divorce, a depressed Assistant Director Skinner meets an attractive blond, Carina Sayles, in a hotel bar and they decide to get ...", "episode_url": "http://www.imdb.com/title/tt0751080/", "episode_rating": 7.8, "season_number": 3}, {"episode_number": 22, "episode_name": "Quagmire", "episode_summary": "Scully and Mulder head off to Georgia when there are reports of people disappearing around a local lake. Scully isn't sure why they're getting involved until she sees a highway sign ...", "episode_url": "http://www.imdb.com/title/tt0751184/", "episode_rating": 8.2, "season_number": 3}, {"episode_number": 23, "episode_name": "Wetwired", "episode_summary": "Scully and Mulder investigate a series of bizarre murders committed by a man who says he saw the killer on TV. They conclude that several people in the community are affected somehow and ...", "episode_url": "http://www.imdb.com/title/tt0751260/", "episode_rating": 8.5, "season_number": 3}, {"episode_number": 24, "episode_name": "Talitha Cumi", "episode_summary": "The agents become involved in the case of a shooting in a fast food restaurant. What interest them the most is the story of a patron who tried to talk the shooter into giving himself up. ...", "episode_url": "http://www.imdb.com/title/tt0751213/", "episode_rating": 8.7, "season_number": 3}, {"episode_number": 1, "episode_name": "Herrenvolk", "episode_summary": "Mulder is intent on saving Jeremiah Smith from the alien bounty hunter if for no other reason than he hopes Smith could save his mother who has suffered a severe stroke. Smith takes him to ...", "episode_url": "http://www.imdb.com/title/tt0751135/", "episode_rating": 8.5, "season_number": 4}, {"episode_number": 2, "episode_name": "Home", "episode_summary": "Scully and Mulder investigate the death of a newborn child found in a shallow grave on the outskirts of a small town. Mulder loves the locale and thinks it's small-town America at its best....", "episode_url": "http://www.imdb.com/title/tt0751137/", "episode_rating": 8.9, "season_number": 4}, {"episode_number": 3, "episode_name": "Teliko", "episode_summary": "Scully is asked by Assistant Director Skinner to assist officials from the Center for Disease Control in determining the cause of a recent number of deaths in the Philadelphia area. All of ...", "episode_url": "http://www.imdb.com/title/tt0751214/", "episode_rating": 6.8, "season_number": 4}, {"episode_number": 4, "episode_name": "Unruhe", "episode_summary": "An intended passport photo for a missing woman develops warped and twisted, showing her terrified and surrounded by beings. With a little investigation, Mulder develops a theory that the ...", "episode_url": "http://www.imdb.com/title/tt0751255/", "episode_rating": 8.3, "season_number": 4}, {"episode_number": 5, "episode_name": "The Field Where I Died", "episode_summary": "Agents Mulder and Scully investigate a suspicious religious cult, which inadvertently draws Mulder into recalling a past life, in the field where he died.", "episode_url": "http://www.imdb.com/title/tt0751225/", "episode_rating": 6.9, "season_number": 4}, {"episode_number": 6, "episode_name": "Sanguinarium", "episode_summary": "Scully and Mulder investigate a particularly gruesome murder at a hospital where a cosmetic surgery patient is butchered by the attending physician. The doctor who performed the operation ...", "episode_url": "http://www.imdb.com/title/tt0751197/", "episode_rating": 7.5, "season_number": 4}, {"episode_number": 7, "episode_name": "Musings of a Cigarette Smoking Man", "episode_summary": "While the Cigarette Smoking Man listens in on a conversation Scully and Mulder are having with Froehike, he recalls his own past and how he got to be where he is today. As a young army ...", "episode_url": "http://www.imdb.com/title/tt0751164/", "episode_rating": 9.0, "season_number": 4}, {"episode_number": 8, "episode_name": "Tunguska", "episode_summary": "Scully and Mulder participate in a raid on a group of right-wing extremists who are obviously planning an attack of some kind. Mulder has been receiving anonymous notes from someone who ...", "episode_url": "http://www.imdb.com/title/tt0751251/", "episode_rating": 8.8, "season_number": 4}, {"episode_number": 9, "episode_name": "Terma", "episode_summary": "Mulder and Krycek are taken prisoner in Russia and subjected to bizarre experiments that includes the black oil and vaccinations. They manage to escape but are separated and find different ...", "episode_url": "http://www.imdb.com/title/tt0751216/", "episode_rating": 8.4, "season_number": 4}, {"episode_number": 10, "episode_name": "Paper Hearts", "episode_summary": "A particularly vivid dream leads Mulder to the burial site of a young girl who had been kidnapped and murdered years before. Mulder knows exactly who the murderer is, John Lee Roche whom ...", "episode_url": "http://www.imdb.com/title/tt0751175/", "episode_rating": 8.9, "season_number": 4}, {"episode_number": 11, "episode_name": "El Mundo Gira", "episode_summary": "Scully and Mulder investigate the death of Maria Dorantes, a migrant farm worker who was found in a field near the shanty town in which she lived. There were reports of a very bright flash ...", "episode_url": "http://www.imdb.com/title/tt0751109/", "episode_rating": 7.0, "season_number": 4}, {"episode_number": 12, "episode_name": "Leonard Betts", "episode_summary": "After an ambulance accident leaves Pittsburgh, PA's EMT of the Year Leonard Betts without a head, and what's left of his body seems to walk right out of the morgue, Mulder and Scully ...", "episode_url": "http://www.imdb.com/title/tt0751153/", "episode_rating": 8.4, "season_number": 4}, {"episode_number": 13, "episode_name": "Never Again", "episode_summary": "With Mulder off on a week's mandatory leave, Scully is on her own and feeling put upon. While in Philadelphia she meets Edward Jerse who asks her out to dinner. Ed has recently gone through...", "episode_url": "http://www.imdb.com/title/tt0751165/", "episode_rating": 7.8, "season_number": 4}, {"episode_number": 14, "episode_name": "Memento Mori", "episode_summary": "The horrible truth behind Scully's illness is revealed: she has cancer and may die. Such has been the fate of a dozen other women who, last year, introduced themselves as abductees and made...", "episode_url": "http://www.imdb.com/title/tt0751158/", "episode_rating": 8.5, "season_number": 4}, {"episode_number": 15, "episode_name": "Kaddish", "episode_summary": "Scully and Mulder investigate a series of murders that began with the beating and shooting of a young Orthodox Jew named Isaac Luria by a gang of young men. One of those men, 16 year-old ...", "episode_url": "http://www.imdb.com/title/tt0751149/", "episode_rating": 7.1, "season_number": 4}, {"episode_number": 16, "episode_name": "Unrequited", "episode_summary": "Scully and Mulder investigate the murders of several Army generals who were killed when they were ostensibly alone. Mulder begins to wonder if the killer isn't a Vietnam veteran who has ...", "episode_url": "http://www.imdb.com/title/tt0751254/", "episode_rating": 7.4, "season_number": 4}, {"episode_number": 17, "episode_name": "Tempus Fugit", "episode_summary": "Mulder and Scully get involved in the investigation of a commercial airliner crash that had among its passengers a well-known alien abductee, Max Fennig. One survivor is found at the crash ...", "episode_url": "http://www.imdb.com/title/tt0751215/", "episode_rating": 8.5, "season_number": 4}, {"episode_number": 18, "episode_name": "Max", "episode_summary": "The investigation continues for agents Mulder and Scully of the apparent downing of Flight 549 by a UFO. They encounter deadly opposition from the military which continues to cover up the truth of incident.", "episode_url": "http://www.imdb.com/title/tt0751156/", "episode_rating": 8.5, "season_number": 4}, {"episode_number": 19, "episode_name": "Synchrony", "episode_summary": "A mysterious old man is killing scientists working on the development of a cryobiologic compound. He freezes them to death with this same compound that doesn't even exist yet.", "episode_url": "http://www.imdb.com/title/tt0751211/", "episode_rating": 7.8, "season_number": 4}, {"episode_number": 20, "episode_name": "Small Potatoes", "episode_summary": "Five unrelated women in a small town give birth to babies with small tails. The prime suspect is a man who can shape shift into whomever he wants.", "episode_url": "http://www.imdb.com/title/tt0751205/", "episode_rating": 9.0, "season_number": 4}, {"episode_number": 21, "episode_name": "Zero Sum", "episode_summary": "A swarm of bees mysteriously kill a postal worker in an enclosed restroom. Assistant Director Skinner covers up the evidence. Mulder investigates Skinner's apparent involvement with the crime.", "episode_url": "http://www.imdb.com/title/tt0751266/", "episode_rating": 8.2, "season_number": 4}, {"episode_number": 22, "episode_name": "Elegy", "episode_summary": "Mulder and Scully investigate a series of deaths after reports that people are seeing the victims' ghosts just before they die. All of the victims were young women and in the most recent ...", "episode_url": "http://www.imdb.com/title/tt0751110/", "episode_rating": 7.9, "season_number": 4}, {"episode_number": 23, "episode_name": "Demons", "episode_summary": "Mulder awakens on a Sunday in a cheap motel in Providence, Rhode Island. He has no idea how he got there and has no memory of what may have occurred in the last two days. His clothes are ...", "episode_url": "http://www.imdb.com/title/tt0751100/", "episode_rating": 8.0, "season_number": 4}, {"episode_number": 24, "episode_name": "Gethsemane", "episode_summary": "Agent Scully appears before a committee chaired by section chief Blevins to account for her and Mulder's recent activities. A Canadian geodetic survey team has apparently found an alien ...", "episode_url": "http://www.imdb.com/title/tt0751130/", "episode_rating": 8.8, "season_number": 4}, {"episode_number": 1, "episode_name": "Redux", "episode_summary": "In a flashback to 24 hours earlier, Scully returns to her apartment to find Mulder waiting for her return to tell her that there is a dead man in his apartment. He now accepts that he has ...", "episode_url": "http://www.imdb.com/title/tt0751187/", "episode_rating": 8.8, "season_number": 5}, {"episode_number": 2, "episode_name": "Redux II", "episode_summary": "With Scully in a hospital ICU, the FBI hierarchy learns that Mulder is alive. So do the conspirators but the Cigarette Smoking Man continues to argue that Mulder is worth far more to them ...", "episode_url": "http://www.imdb.com/title/tt0751188/", "episode_rating": 9.0, "season_number": 5}, {"episode_number": 3, "episode_name": "Unusual Suspects", "episode_summary": "The origins of the Lone Gunmen and their relationship with Mulder are revealed in this episode. All three were at a computer and electronics trade show in Baltimore in 1989 when they put ...", "episode_url": "http://www.imdb.com/title/tt0751256/", "episode_rating": 8.6, "season_number": 5}, {"episode_number": 4, "episode_name": "Detour", "episode_summary": "While driving down to Florida with two other FBI agents to attend a team-building seminar, Scully and Mulder are drawn into the disappearance of several men in a wooded area. Rumors are ...", "episode_url": "http://www.imdb.com/title/tt0751101/", "episode_rating": 8.3, "season_number": 5}, {"episode_number": 5, "episode_name": "The Post-Modern Prometheus", "episode_summary": "Mulder and Scully travel to a small town after Mulder receives a letter asking for his help in solving a mystery. The townsfolk believe there is a Frankenstein-type monster living in the ...", "episode_url": "http://www.imdb.com/title/tt0751232/", "episode_rating": 8.6, "season_number": 5}, {"episode_number": 6, "episode_name": "Christmas Carol", "episode_summary": "At Christmas-time, Scully and her Mom arrive in San Diego to visit her brother Bill and his wife Tara, who is expecting any day. She's no sooner arrived than Scully receives a phone from a ...", "episode_url": "http://www.imdb.com/title/tt0751090/", "episode_rating": 7.9, "season_number": 5}, {"episode_number": 7, "episode_name": "Emily", "episode_summary": "With DNA evidence showing that Scully is in fact Emily's mother, Mulder travels to San Diego to help his partner make sense of it all. Mulder thinks it's all related to Scully's abduction ...", "episode_url": "http://www.imdb.com/title/tt0751111/", "episode_rating": 7.8, "season_number": 5}, {"episode_number": 8, "episode_name": "Kitsunegari", "episode_summary": "Robert Modell (seeThe X-Files: Pusher(1996) ) seems to have recovered from his gunshot wounds and is again using his power of suggestion to get his victims to see things that are not ...", "episode_url": "http://www.imdb.com/title/tt0751151/", "episode_rating": 7.9, "season_number": 5}, {"episode_number": 9, "episode_name": "Schizogeny", "episode_summary": "Scully and Mulder investigate the death of a man who seems to have been buried alive. The main suspect is the man's stepson as the two of them had a argument the evening the man dies. The ...", "episode_url": "http://www.imdb.com/title/tt0751199/", "episode_rating": 7.3, "season_number": 5}, {"episode_number": 10, "episode_name": "Chinga", "episode_summary": "While on a weekend off in the small New England town of Ammab Beach, Scully comes across a grocery store full of people who tried to gouge out their own eyes. The people have no idea why ...", "episode_url": "http://www.imdb.com/title/tt0751089/", "episode_rating": 7.7, "season_number": 5}, {"episode_number": 11, "episode_name": "Kill Switch", "episode_summary": "Mulder and Scully's investigation into a mass shooting in a coffee shop leads them to believe that the targets were not the low level drug dealers and wholesalers who were killed but rather...", "episode_url": "http://www.imdb.com/title/tt0751150/", "episode_rating": 8.0, "season_number": 5}, {"episode_number": 12, "episode_name": "Bad Blood", "episode_summary": "After Mulder drives a stake through the heart of a would be vampire, he and Scully review what happened before they meet Assistant Director Skinner. Their recollection of the case is ...", "episode_url": "http://www.imdb.com/title/tt0751081/", "episode_rating": 9.3, "season_number": 5}, {"episode_number": 13, "episode_name": "Patient X", "episode_summary": "Victims of alien abductions are being killed which confounds those responsible for the alien conspiracy. They also have a problem on their hands when Alex Krycek returns to the U.S. from ...", "episode_url": "http://www.imdb.com/title/tt0751177/", "episode_rating": 8.4, "season_number": 5}, {"episode_number": 14, "episode_name": "The Red and the Black", "episode_summary": "Scully survives the mass killing but has no memory of what might have happened. She agrees to undergo regression hypnosis and recalls what happened, including that Cassandra Spender was ...", "episode_url": "http://www.imdb.com/title/tt0751234/", "episode_rating": 8.5, "season_number": 5}, {"episode_number": 15, "episode_name": "Travelers", "episode_summary": "In 1990 a man dies and the last word he utters is Mulder. Mulder thinking that this has something to do with his father, investigates and learns that the man supposedly died in 1952. He ...", "episode_url": "http://www.imdb.com/title/tt0751247/", "episode_rating": 7.7, "season_number": 5}, {"episode_number": 16, "episode_name": "Mind's Eye", "episode_summary": "Mulder and Scully assist local police when they suspect woman they arrested at a murder scene, Marty Glenn, is the murderer. The problem is that the woman is blind. Mulder finds it all very...", "episode_url": "http://www.imdb.com/title/tt0751161/", "episode_rating": 7.9, "season_number": 5}, {"episode_number": 17, "episode_name": "All Souls", "episode_summary": "In the confessional at her local church, Scully tells a priest that she is responsible for the death of young girl. In flashbacks, Scully and Mulder are called in when a young woman is ...", "episode_url": "http://www.imdb.com/title/tt0751070/", "episode_rating": 7.7, "season_number": 5}, {"episode_number": 18, "episode_name": "The Pine Bluff Variant", "episode_summary": "Scully is worried about Mulder when during an undercover sting operation, Mulder apparently lets a suspect, Jacob Steven Haley, escape. Haley is a right-wing anti-government militiaman who ...", "episode_url": "http://www.imdb.com/title/tt0751231/", "episode_rating": 8.3, "season_number": 5}, {"episode_number": 19, "episode_name": "Folie a Deux", "episode_summary": "Mulder and Scully are sent to Chicago after after a telemarketing firm receives anonymous threats. The company is particularly concerned as they had an employee go postal in a different ...", "episode_url": "http://www.imdb.com/title/tt0751127/", "episode_rating": 8.7, "season_number": 5}, {"episode_number": 20, "episode_name": "The End", "episode_summary": "During a chess tournament, a young boy becomes the centre of an investigation concerning the alien mythology. Meanwhile a face from Agent Mulder's past causes friction in his relationship with Agent Scully.", "episode_url": "http://www.imdb.com/title/tt0751223/", "episode_rating": 8.9, "season_number": 5}, {"episode_number": 1, "episode_name": "The Beginning", "episode_summary": "Mulder and Scully's ability to pursue the X-Files and their partnership is threatened by the hunt for a deadly creature in the Arizona desert, whose capture could prove Mulder's theories about the existence of extraterrestrial life.", "episode_url": "http://www.imdb.com/title/tt0751220/", "episode_rating": 8.2, "season_number": 6}, {"episode_number": 2, "episode_name": "Drive", "episode_summary": "With Mulder trapped in a car by a seemingly deranged man, Scully races to determine if the man is suffering from a deadly illness and if Mulder is in danger of becoming the next victim.", "episode_url": "http://www.imdb.com/title/tt0751106/", "episode_rating": 8.5, "season_number": 6}, {"episode_number": 3, "episode_name": "Triangle", "episode_summary": "A trip to the Bermuda Triangle lands Mulder in the middle of a bizarre conflict on a mysterious ship, with the fate of the world in his hands.", "episode_url": "http://www.imdb.com/title/tt0751249/", "episode_rating": 8.7, "season_number": 6}, {"episode_number": 4, "episode_name": "Dreamland", "episode_summary": "An anonymous tip finally brings Mulder and Scully to the mecca of all UFO lore, Area 51. But when the agents witness the flight of a mysterious craft, their lives are profoundly and perhaps irrevocably altered.", "episode_url": "http://www.imdb.com/title/tt0751104/", "episode_rating": 9.0, "season_number": 6}, {"episode_number": 5, "episode_name": "Dreamland II", "episode_summary": "Scully begins to suspect that her partner's strange behavior is more than it appears to be, while Mulder fights to return his life to normal before it's too late.", "episode_url": "http://www.imdb.com/title/tt0751105/", "episode_rating": 8.9, "season_number": 6}, {"episode_number": 6, "episode_name": "How the Ghosts Stole Christmas", "episode_summary": "On Christmas Eve, Mulder and Scully stakeout a house that is supposedly haunted by the ghosts of two lovers who killed each other in a lovers' pact 81 years before. Inside, the agents find ...", "episode_url": "http://www.imdb.com/title/tt0751138/", "episode_rating": 8.3, "season_number": 6}, {"episode_number": 7, "episode_name": "Terms of Endearment", "episode_summary": "Mulder suspects demon fetal harvesting when a woman claims her unborn child had a horn and tail and was taken by a devil while she slept. While others conclude that the woman killed her own...", "episode_url": "http://www.imdb.com/title/tt0751217/", "episode_rating": 7.9, "season_number": 6}, {"episode_number": 8, "episode_name": "The Rain King", "episode_summary": "A mayor of a small town asks Mulder and Scully to investigate Daryl Mootz, a man who apparently can make it rain at will. The mayor believes Mootz is responsible for causing a local drought...", "episode_url": "http://www.imdb.com/title/tt0751233/", "episode_rating": 7.5, "season_number": 6}, {"episode_number": 9, "episode_name": "S.R. 819", "episode_summary": "Skinner comes down with a mysterious condition that puts him on the verge of death. An unknown voice on the phone tells Skinner that he has 24 hours to live. Mulder and Scully rush to find ...", "episode_url": "http://www.imdb.com/title/tt0751195/", "episode_rating": 8.2, "season_number": 6}, {"episode_number": 10, "episode_name": "Tithonus", "episode_summary": "Agent Scully gets paired up with a new partner to investigate a singular case. Alfred Fellig, a freelance crime photographer, has a knack for arriving at crime scenes shortly after the ...", "episode_url": "http://www.imdb.com/title/tt0751245/", "episode_rating": 8.4, "season_number": 6}, {"episode_number": 11, "episode_name": "Two Fathers", "episode_summary": "After being gone for almost a year following her abduction, Cassandra Spender reappears, in perfect physical condition as the first successful alien/human hybrid. The consortium scrambles ...", "episode_url": "http://www.imdb.com/title/tt0751252/", "episode_rating": 8.8, "season_number": 6}, {"episode_number": 12, "episode_name": "One Son", "episode_summary": "Agents Mulder and Scully find themselves under strict quarantine after coming into contact with Cassandra Spender. Meanwhile, the suspicious Diana Fowley increases her loyalties to the Cigarette Smoking Man.", "episode_url": "http://www.imdb.com/title/tt0751170/", "episode_rating": 8.9, "season_number": 6}, {"episode_number": 13, "episode_name": "Agua Mala", "episode_summary": "At Arthur Dales' request, the agents go to Florida during a hurricane to investigate the disappearance of Mr. Dales' neighbors, two marine biologists and their son. During the storm, Mulder...", "episode_url": "http://www.imdb.com/title/tt0751069/", "episode_rating": 7.6, "season_number": 6}, {"episode_number": 14, "episode_name": "Monday", "episode_summary": "A bank robbery gone wrong turns into disaster for Mulder and Scully. Mulder gets shot by the bank robber, and he and Scully, along with everyone else in the bank are blown up by a bomb ...", "episode_url": "http://www.imdb.com/title/tt0751163/", "episode_rating": 8.8, "season_number": 6}, {"episode_number": 15, "episode_name": "Arcadia", "episode_summary": "Scully and Mulder go undercover as husband and wife in a high-class planned community where several couples have gone missing.", "episode_url": "http://www.imdb.com/title/tt0751076/", "episode_rating": 8.6, "season_number": 6}, {"episode_number": 16, "episode_name": "Alpha", "episode_summary": "Mulder and Scully investigate a series of murders that may be connected to a Chinese breed of dog.", "episode_url": "http://www.imdb.com/title/tt0751073/", "episode_rating": 6.7, "season_number": 6}, {"episode_number": 17, "episode_name": "Trevor", "episode_summary": "An escaped convict apparently has the ability to pass through solid objects. He has $90,000 hidden somewhere from the bank robbery for which he was imprisoned. Mulder and Scully must find ...", "episode_url": "http://www.imdb.com/title/tt0751248/", "episode_rating": 7.3, "season_number": 6}, {"episode_number": 18, "episode_name": "Milagro", "episode_summary": "An introverted writer, Philip Padgett, develops an obsession with Scully and moves into Mulder's building in order to be closer to her. Inspired by her, Padgett writes his magnum opus: a ...", "episode_url": "http://www.imdb.com/title/tt0751159/", "episode_rating": 8.0, "season_number": 6}, {"episode_number": 19, "episode_name": "The Unnatural", "episode_summary": "Mulder uncovers a story involving a Negro baseball player in the 1940s who played for a minor league team in Roswell. When in a photograph he sees the Alien Bounty Hunter it is assumed that Josh Exley, the baseball player in question, might just be alien himself.", "episode_url": "http://www.imdb.com/title/tt0751239/", "episode_rating": 8.6, "season_number": 6}, {"episode_number": 20, "episode_name": "Three of a Kind", "episode_summary": "The Lone Gunmen are at a defense contractors convention in Las Vegas trying to get inside information on military secrets. When Byers spots Susanne Modeski at a casino, he convinces the ...", "episode_url": "http://www.imdb.com/title/tt0751244/", "episode_rating": 8.1, "season_number": 6}, {"episode_number": 21, "episode_name": "Field Trip", "episode_summary": "A young married couple's skeletons are found together on a field in the mountains after only being reported missing for three days. The area where their skeletons were found is known for ...", "episode_url": "http://www.imdb.com/title/tt0751122/", "episode_rating": 8.7, "season_number": 6}, {"episode_number": 22, "episode_name": "Biogenesis", "episode_summary": "An artifact with strange engravings on it is found off of the coast of Africa. When a rubbing of these engravings is shown to Mulder, confusing noises happen inside his head. The agents ...", "episode_url": "http://www.imdb.com/title/tt0419384/", "episode_rating": 8.5, "season_number": 6}, {"episode_number": 1, "episode_name": "The Sixth Extinction", "episode_summary": "In Africa, Scully searches for answers for Mulder's condition by studying rubbings taken from the fallen spacecraft. Back in D.C., Skinner tries to help Mulder by finding Michael Kritschgau...", "episode_url": "http://www.imdb.com/title/tt0751235/", "episode_rating": 8.1, "season_number": 7}, {"episode_number": 2, "episode_name": "The Sixth Extinction II: Amor Fati", "episode_summary": "Mulder's condition continues to deteriorate. He is kidnapped from the hospital by the Cigarette Smoking Man for insidious purposes. Mulder experiences dreams of another life, away from the ...", "episode_url": "http://www.imdb.com/title/tt0751236/", "episode_rating": 8.1, "season_number": 7}, {"episode_number": 3, "episode_name": "Hungry", "episode_summary": "Rob Roberts has an addiction to human brains. As he tries to control this overpowering hunger and turn his life around, Mulder and Scully try to find out who the brain-eating monster is.", "episode_url": "http://www.imdb.com/title/tt0751140/", "episode_rating": 8.0, "season_number": 7}, {"episode_number": 4, "episode_name": "Millennium", "episode_summary": "At the turn of the 21st century, a religious fanatic enlisted by the Millennium Group resurrects four members of the group as zombies to bring about the end of the world. Mulder and Scully ...", "episode_url": "http://www.imdb.com/title/tt0751160/", "episode_rating": 8.1, "season_number": 7}, {"episode_number": 5, "episode_name": "Rush", "episode_summary": "A high school boy is accused of the violent murder of a sheriff's deputy. Mulder believes he is innocent. The agents find that someone with super-human speed may be the culprit.", "episode_url": "http://www.imdb.com/title/tt0751194/", "episode_rating": 7.6, "season_number": 7}, {"episode_number": 6, "episode_name": "The Goldberg Variation", "episode_summary": "A man is tossed off the top of a 29 story building by gangsters. Amazingly, he gets up and walks away unscathed. Mulder and Scully investigate when Mulder suspects this man may have ...", "episode_url": "http://www.imdb.com/title/tt0751227/", "episode_rating": 8.4, "season_number": 7}, {"episode_number": 7, "episode_name": "Orison", "episode_summary": "Five years have passed since Scully escaped from Donnie Pfaster, an obsessed death fetishist. When Reverend Orison helps the madman get away from prison he immediately turns to the 'one' that got away...Scully.", "episode_url": "http://www.imdb.com/title/tt0751171/", "episode_rating": 7.7, "season_number": 7}, {"episode_number": 8, "episode_name": "The Amazing Maleeni", "episode_summary": "Mulder and Scully investigate the apparent murder of a magician who was decapitated just minutes after he was able to perform the trick of turning his head around 360 degrees. The agents ...", "episode_url": "http://www.imdb.com/title/tt0751219/", "episode_rating": 8.3, "season_number": 7}, {"episode_number": 9, "episode_name": "Signs & Wonders", "episode_summary": "A man is found dead in his locked car, killed from over a hundred snake bites. However, no evidence of snakes being present is found. The man was a former member of a religious cult that ...", "episode_url": "http://www.imdb.com/title/tt0751203/", "episode_rating": 7.0, "season_number": 7}, {"episode_number": 10, "episode_name": "Sein und Zeit", "episode_summary": "Mulder requests to be put on the case of a seemingly routine child abduction case of a missing little girl. Mulder finds a connection between this case and old x-files involving missing ...", "episode_url": "http://www.imdb.com/title/tt0751200/", "episode_rating": 8.2, "season_number": 7}, {"episode_number": 11, "episode_name": "Closure", "episode_summary": "Mulder enlists the help of Harold Piller, a police psychic, to search for the missing girl, Amber Lynn LaPierre. Meanwhile, Scully searches for answers about Samantha's abduction, leading ...", "episode_url": "http://www.imdb.com/title/tt0751091/", "episode_rating": 8.3, "season_number": 7}, {"episode_number": 12, "episode_name": "X-Cops", "episode_summary": "The investigation of a neighborhood monster isn't too weird for the crew of Cops to follow around Mulder and Scully.", "episode_url": "http://www.imdb.com/title/tt0751264/", "episode_rating": 8.4, "season_number": 7}, {"episode_number": 13, "episode_name": "First Person Shooter", "episode_summary": "The Lone Gunmen request Mulder and Scully's assistance in a murder case at a video game company. A virtual reality game has gone haywire, and players are dying for real at the hands of ...", "episode_url": "http://www.imdb.com/title/tt0751126/", "episode_rating": 6.7, "season_number": 7}, {"episode_number": 14, "episode_name": "Theef", "episode_summary": "Voodoo appears to be involved in the murder of a prominent doctor's father-in-law. Mulder and Scully work to stop the killer who uses hex-craft to exact his revenge on the doctor's family.", "episode_url": "http://www.imdb.com/title/tt0751241/", "episode_rating": 7.5, "season_number": 7}, {"episode_number": 15, "episode_name": "En Ami", "episode_summary": "A boy is miraculously cured of his cancer, without medical treatment. After Scully visits the boy and his family, she is met by the Cigarette Smoking Man. He offers Scully the chance to ...", "episode_url": "http://www.imdb.com/title/tt0751113/", "episode_rating": 8.3, "season_number": 7}, {"episode_number": 16, "episode_name": "Chimera", "episode_summary": "Mulder and Scully are on a stakeout of a female serial-killer of prostitutes. Mulder gets called away from the stakeout by Skinner to investigate the disappearance of federal judge's ...", "episode_url": "http://www.imdb.com/title/tt0751088/", "episode_rating": 7.7, "season_number": 7}, {"episode_number": 17, "episode_name": "All Things", "episode_summary": "Scully is finishing up the autopsy of a person at a hospital. A file mix-up involving the autopsy folder and another patient's x-ray leads Scully to discover a former lover of hers has been...", "episode_url": "http://www.imdb.com/title/tt0751071/", "episode_rating": 7.4, "season_number": 7}, {"episode_number": 18, "episode_name": "Brand X", "episode_summary": "A potential witness in a high-profile tobacco case under Skinner's supervision, is found dead in his bathroom from mysterious circumstances. Skinner asks Mulder and Scully to assist him in ...", "episode_url": "http://www.imdb.com/title/tt0751087/", "episode_rating": 7.9, "season_number": 7}, {"episode_number": 19, "episode_name": "Hollywood A.D.", "episode_summary": "Skinner's buddy from college, Wayne Federman, trails Mulder and Scully on a case involving a pipe bombing in a church, at Skinner's insistence. Wayne is a writer/producer from Hollywood ...", "episode_url": "http://www.imdb.com/title/tt0751136/", "episode_rating": 7.7, "season_number": 7}, {"episode_number": 20, "episode_name": "Fight Club", "episode_summary": "Two strikingly similar women, who do not know one another, cause people to erupt into violence upon each other, whenever these two women come in contact. Mulder and Scully set out to solve ...", "episode_url": "http://www.imdb.com/title/tt0751123/", "episode_rating": 6.3, "season_number": 7}, {"episode_number": 21, "episode_name": "Je Souhaite", "episode_summary": "Two brothers have a less than helpful genie who grants their wishes with disastrous consequences. Mulder comes into possession of the same genie, and his wishes garner similar results.", "episode_url": "http://www.imdb.com/title/tt0751145/", "episode_rating": 8.6, "season_number": 7}, {"episode_number": 22, "episode_name": "Requiem", "episode_summary": "Nearly a decade since their first case, Agents Mulder and Scully return to Oregon to investigate a strange entity in a forest, risking their partnership and lives.", "episode_url": "http://www.imdb.com/title/tt0751190/", "episode_rating": 8.8, "season_number": 7}, {"episode_number": 1, "episode_name": "Within", "episode_summary": "New Deputy Director Kersh has Agent John Doggett investigate the missing Mulder case. Doggett's skeptical treatment of Mulder's disappearance puts a thorn in Scully and Skinner's sides.", "episode_url": "http://www.imdb.com/title/tt0751262/", "episode_rating": 8.4, "season_number": 8}, {"episode_number": 2, "episode_name": "Without", "episode_summary": "Scully leads Skinner and an unhappy Doggett to Arizona to protect Gibson Praise from an Alien Bounty Hunter disguised as the missing Mulder.", "episode_url": "http://www.imdb.com/title/tt0751263/", "episode_rating": 8.5, "season_number": 8}, {"episode_number": 3, "episode_name": "Patience", "episode_summary": "Scully isn't exactly warm to Doggett on their first X-File together in which they investigate a human bat.", "episode_url": "http://www.imdb.com/title/tt0751176/", "episode_rating": 7.8, "season_number": 8}, {"episode_number": 4, "episode_name": "Roadrunners", "episode_summary": "Doggett is a little dismayed when Scully investigates a murder in a barely inhabited town in Utah without him. When Scully's car breaks down and she finds the town people aren't as sweet as they seem she struggles to find a way out of the demented town.", "episode_url": "http://www.imdb.com/title/tt0751192/", "episode_rating": 8.3, "season_number": 8}, {"episode_number": 5, "episode_name": "Invocation", "episode_summary": "Doggett and Scully once again butt heads on their latest X-File which involves a boy who has returned after being missing for ten years but still appears to be seven years old, the age he was the day he was abducted.", "episode_url": "http://www.imdb.com/title/tt0751143/", "episode_rating": 8.0, "season_number": 8}, {"episode_number": 6, "episode_name": "Redrum", "episode_summary": "A man lives the most recent 5 days of his life backwards and finds out that he is the main suspect in the murder of his wife.", "episode_url": "http://www.imdb.com/title/tt0751186/", "episode_rating": 8.5, "season_number": 8}, {"episode_number": 7, "episode_name": "Via Negativa", "episode_summary": "While Scully tends to her secret, Doggett and Skinner team up to track a cult leader who may be a psychic assassin.", "episode_url": "http://www.imdb.com/title/tt0751257/", "episode_rating": 7.9, "season_number": 8}, {"episode_number": 8, "episode_name": "Surekill", "episode_summary": "Doggett and Scully deal with a killer who may have X-Ray vision.", "episode_url": "http://www.imdb.com/title/tt0751210/", "episode_rating": 7.2, "season_number": 8}, {"episode_number": 9, "episode_name": "Salvage", "episode_summary": "A man believed to be dead from Gulf War Syndrome comes back to life and slowly turns into metal.", "episode_url": "http://www.imdb.com/title/tt0751196/", "episode_rating": 7.1, "season_number": 8}, {"episode_number": 10, "episode_name": "Badlaa", "episode_summary": "A small Indian man on a creaky cart is believed to have the ability to leap into people's bodies.", "episode_url": "http://www.imdb.com/title/tt0751082/", "episode_rating": 7.3, "season_number": 8}, {"episode_number": 11, "episode_name": "The Gift", "episode_summary": "Skinner and Doggett investigate a case Mulder was working on before he disappeared involving a family and a monster straight from Native American lore.", "episode_url": "http://www.imdb.com/title/tt0751226/", "episode_rating": 8.0, "season_number": 8}, {"episode_number": 12, "episode_name": "Medusa", "episode_summary": "Doggett takes to the Boston subways to try to figure out where a deadly agent that is killing citizens is coming from.", "episode_url": "http://www.imdb.com/title/tt0751157/", "episode_rating": 7.7, "season_number": 8}, {"episode_number": 13, "episode_name": "Per Manum", "episode_summary": "Scully stumbles upon a woman whose abductee experience and symptoms are amazingly similar. The fear now is that both their upcoming births will be to non-human offspring.", "episode_url": "http://www.imdb.com/title/tt0751178/", "episode_rating": 8.1, "season_number": 8}, {"episode_number": 14, "episode_name": "This Is Not Happening", "episode_summary": "Jeremiah Smith appears out of nowhere and formerly dead abductees are coming back to life, giving Scully and Skinner the idea that Mulder may have a shot at still being alive.", "episode_url": "http://www.imdb.com/title/tt0751242/", "episode_rating": 8.6, "season_number": 8}, {"episode_number": 15, "episode_name": "Deadalive", "episode_summary": "Billy Miles, thought dead, is found alive and Scully still thinks the still-dead Mulder can come back to life; meanwhile Skinner comes in contact with Krycek who may have a clue as to what ...", "episode_url": "http://www.imdb.com/title/tt0751098/", "episode_rating": 8.5, "season_number": 8}, {"episode_number": 16, "episode_name": "Three Words", "episode_summary": "A man is shot on the White House lawn with a disk titled \"Fight the Future\"; Mulder, on the brink of expulsion from the X-Files, investigates while Doggett uses an old friend from the ...", "episode_url": "http://www.imdb.com/title/tt0751243/", "episode_rating": 8.4, "season_number": 8}, {"episode_number": 17, "episode_name": "Empedocles", "episode_summary": "When some of us are vulnerable we can let pure evil come inside us, like in the case of a recently fired worker. But does the evil inside him have a connection to the murder of Doggett's son Luke?", "episode_url": "http://www.imdb.com/title/tt0751112/", "episode_rating": 7.4, "season_number": 8}, {"episode_number": 18, "episode_name": "Vienen", "episode_summary": "Doggett and Mulder unwillingly team up investigating an oil rig where some mysterious murders have happened and the possibility of the Black Cancer being involved is a haunting reality.", "episode_url": "http://www.imdb.com/title/tt0751258/", "episode_rating": 8.1, "season_number": 8}, {"episode_number": 19, "episode_name": "Alone", "episode_summary": "A bizarre reptilian creature captures Doggett and his new Mulder-obsessed partner underground and only a X-Files deposed Mulder can help them.", "episode_url": "http://www.imdb.com/title/tt0751072/", "episode_rating": 8.1, "season_number": 8}, {"episode_number": 20, "episode_name": "Essence", "episode_summary": "The X-Files team must protect Agent Scully and her unborn child as groups of Super Soldiers try to stop her pregnancy.", "episode_url": "http://www.imdb.com/title/tt0751115/", "episode_rating": 8.6, "season_number": 8}, {"episode_number": 21, "episode_name": "Existence", "episode_summary": "Agents Mulder, Doggett and Skinner investigate (along with Alex Krycek) the Super Soldier conspiracy, while Scully goes into hiding to have her child.", "episode_url": "http://www.imdb.com/title/tt0751118/", "episode_rating": 8.9, "season_number": 8}, {"episode_number": 1, "episode_name": "Nothing Important Happened Today", "episode_summary": "Doggett's investigation of Kersh and the FBI isn't making him any friends, especially Brad Follmer, a new Assistant Director who has a romantic past with Reyes. Meanwhile Scully denies to tell anyone where Mulder has gone while a female super soldier is on the loose and may give Doggett the clues he needs to make his point known.", "episode_url": "http://www.imdb.com/title/tt0751167/", "episode_rating": 7.7, "season_number": 9}, {"episode_number": 2, "episode_name": "Nothing Important Happened Today II", "episode_summary": "While Reyes and Skinner try to convince him otherwise, Doggett practically goes rogue for his own pursuit of the Truth. His findings, and help from the female super soldier Shannon McMahon, may lead to answers critical to the status and health of William Scully. But Knowle Rohrer is back from 'the dead' and stands in their way.", "episode_url": "http://www.imdb.com/title/tt0751168/", "episode_rating": 7.7, "season_number": 9}, {"episode_number": 3, "episode_name": "Dæmonicus", "episode_summary": "A professor/inmate in a psychiatric ward may be influencing other men to kill ritualistically. Though Doggett sees it as pure manipulation, Reyes can't help but suspect none else but the devil himself possessing the professor's body.", "episode_url": "http://www.imdb.com/title/tt0751096/", "episode_rating": 7.5, "season_number": 9}, {"episode_number": 4, "episode_name": "4-D", "episode_summary": "A killer murders Reyes and mortally wounds Doggett...in another dimension. Reyes, under investigation for a nearly killed Doggett realizes the killer can shift dimensions to fill out his disgusting fantasies.", "episode_url": "http://www.imdb.com/title/tt0751067/", "episode_rating": 8.0, "season_number": 9}, {"episode_number": 5, "episode_name": "Lord of the Flies", "episode_summary": "Doggett and Reyes are unsure whether a boy intentionally or unintentionally can control the habits of flies; during the investigation Scully acquires a new 'partner'.", "episode_url": "http://www.imdb.com/title/tt0751155/", "episode_rating": 7.0, "season_number": 9}, {"episode_number": 6, "episode_name": "Trust No 1", "episode_summary": "Mulder contacts Scully which sets off a chain of events involving an NSA man obsessed with speaking and giving information to Mulder.", "episode_url": "http://www.imdb.com/title/tt0751250/", "episode_rating": 7.8, "season_number": 9}, {"episode_number": 7, "episode_name": "John Doe", "episode_summary": "Doggett wakes up in Mexico and can't remember his name or what he is doing there. His only clues are small flashbacks of a child (his son) and two mysterious marks on his head.", "episode_url": "http://www.imdb.com/title/tt0751146/", "episode_rating": 7.9, "season_number": 9}, {"episode_number": 8, "episode_name": "Hellbound", "episode_summary": "Reyes finds herself inexplicably connected to a case involving ex-cons who are being skinned.", "episode_url": "http://www.imdb.com/title/tt0751134/", "episode_rating": 7.5, "season_number": 9}, {"episode_number": 9, "episode_name": "Provenance", "episode_summary": "A man is chased from the Canada/US border and reportedly burned alive though his body is not found. Meanwhile, in the burned remains the FBI finds papers with the same UFO markings Scully found in Africa.", "episode_url": "http://www.imdb.com/title/tt0751181/", "episode_rating": 7.9, "season_number": 9}, {"episode_number": 10, "episode_name": "Providence", "episode_summary": "Scully's baby becomes a bargaining chip for a psychotic UFO cult that feels the baby is ultimately connected to a UFO they have uncovered.", "episode_url": "http://www.imdb.com/title/tt0751182/", "episode_rating": 7.7, "season_number": 9}, {"episode_number": 11, "episode_name": "Audrey Pauley", "episode_summary": "Reyes is seriously injured in a car accident and finds herself in a hospital similar to purgatory with other hospital patients suffering from serious traumas. Slowly they all begin to disappear. Meanwhile, in the real world, Doggett refuses to accept his friend's 'mortal' wounds and uses a bizarre hospital employee to both connect with Reyes in the other-world and capture a 'Dr. Death.'", "episode_url": "http://www.imdb.com/title/tt0751079/", "episode_rating": 7.9, "season_number": 9}, {"episode_number": 12, "episode_name": "Underneath", "episode_summary": "After thirteen years in prison, a man named Fassl is released and cleared of murder charges when DNA evidence proves he had nothing to do with the murder of an entire family though he was present on the scene. Doggett, who made the arrest, refuses to accept Fassl's innocence and pursues the case again.", "episode_url": "http://www.imdb.com/title/tt0751253/", "episode_rating": 7.4, "season_number": 9}, {"episode_number": 13, "episode_name": "Improbable", "episode_summary": "Reyes, Doggett, and Scully are pulled into a bizarre serial murder case involving the number '3', numerology on a whole, and an eccentric man who likes to play checkers.", "episode_url": "http://www.imdb.com/title/tt0751142/", "episode_rating": 7.7, "season_number": 9}, {"episode_number": 14, "episode_name": "Scary Monsters", "episode_summary": "Reyes and Doggett, with the aid of a young Mulder-worshiping FBI agent, investigate a father who is exhibiting bizarre behavior regarding his son who he has kept hidden from the outside world.", "episode_url": "http://www.imdb.com/title/tt0751198/", "episode_rating": 7.7, "season_number": 9}, {"episode_number": 15, "episode_name": "Jump the Shark", "episode_summary": "The Lone Gunmen, with the (unwanted) aide of Morris Fletcher, must stop a destructive virus from entering the populace.", "episode_url": "http://www.imdb.com/title/tt0751148/", "episode_rating": 7.7, "season_number": 9}, {"episode_number": 16, "episode_name": "William", "episode_summary": "A disfigured man attacks Doggett trying to retrieve X-Files for Mulder...but he might be Mulder himself.", "episode_url": "http://www.imdb.com/title/tt0751261/", "episode_rating": 7.9, "season_number": 9}, {"episode_number": 17, "episode_name": "Release", "episode_summary": "A Frank Black-esque cadet in Scully's class directs Doggett to a current murder case that may have something to do with a case that went unsolved 9 years prior...the murder of his young son.", "episode_url": "http://www.imdb.com/title/tt0751189/", "episode_rating": 8.4, "season_number": 9}, {"episode_number": 18, "episode_name": "Sunshine Days", "episode_summary": "Reyes and Doggett investigate two murders revolving around a house that is, at some points in time, identical to the Brady Bunch house.", "episode_url": "http://www.imdb.com/title/tt0751209/", "episode_rating": 7.9, "season_number": 9}, {"episode_number": 19, "episode_name": "The Truth: Parts 1 & 2", "episode_summary": "Mulder's return leads to his being tried before a military tribunal that seeks to justify and prove the very existence of an alien conspiracy -- and the X-Files.", "episode_url": "http://www.imdb.com/title/tt0408347/", "episode_rating": 8.3, "season_number": 9}]